GopalSaraf/Practicals/PSDL/include/proc/pic18f24k42.h
// Register: DMA2SSZH
#define DMA2SSZH DMA2SSZH
extern volatile unsigned char           DMA2SSZH            __at(0x3BD8);
#ifndef _LIB_BUILD
asm("DMA2SSZH equ 03BD8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSZ                    :4;
    };
    struct {
        unsigned DMA2SSZ                :4;
    };
    struct {
        unsigned SSZ8                   :1;
        unsigned SSZ9                   :1;
        unsigned SSZ10                  :1;
        unsigned SSZ11                  :1;
    };
    struct {
        unsigned DMA2SSZ8               :1;
        unsigned DMA2SSZ9               :1;
        unsigned DMA2SSZ10              :1;
        unsigned DMA2SSZ11              :1;
    };
} DMA2SSZHbits_t;
extern volatile DMA2SSZHbits_t DMA2SSZHbits __at(0x3BD8);
// bitfield macros
#define _DMA2SSZH_SSZ_POSN                                  0x0
#define _DMA2SSZH_SSZ_POSITION                              0x0
#define _DMA2SSZH_SSZ_SIZE                                  0x4
#define _DMA2SSZH_SSZ_LENGTH                                0x4
#define _DMA2SSZH_SSZ_MASK                                  0xF
#define _DMA2SSZH_DMA2SSZ_POSN                              0x0
#define _DMA2SSZH_DMA2SSZ_POSITION                          0x0
#define _DMA2SSZH_DMA2SSZ_SIZE                              0x4
#define _DMA2SSZH_DMA2SSZ_LENGTH                            0x4
#define _DMA2SSZH_DMA2SSZ_MASK                              0xF
#define _DMA2SSZH_SSZ8_POSN                                 0x0
#define _DMA2SSZH_SSZ8_POSITION                             0x0
#define _DMA2SSZH_SSZ8_SIZE                                 0x1
#define _DMA2SSZH_SSZ8_LENGTH                               0x1
#define _DMA2SSZH_SSZ8_MASK                                 0x1
#define _DMA2SSZH_SSZ9_POSN                                 0x1
#define _DMA2SSZH_SSZ9_POSITION                             0x1
#define _DMA2SSZH_SSZ9_SIZE                                 0x1
#define _DMA2SSZH_SSZ9_LENGTH                               0x1
#define _DMA2SSZH_SSZ9_MASK                                 0x2
#define _DMA2SSZH_SSZ10_POSN                                0x2
#define _DMA2SSZH_SSZ10_POSITION                            0x2
#define _DMA2SSZH_SSZ10_SIZE                                0x1
#define _DMA2SSZH_SSZ10_LENGTH                              0x1
#define _DMA2SSZH_SSZ10_MASK                                0x4
#define _DMA2SSZH_SSZ11_POSN                                0x3
#define _DMA2SSZH_SSZ11_POSITION                            0x3
#define _DMA2SSZH_SSZ11_SIZE                                0x1
#define _DMA2SSZH_SSZ11_LENGTH                              0x1
#define _DMA2SSZH_SSZ11_MASK                                0x8
#define _DMA2SSZH_DMA2SSZ8_POSN                             0x0
#define _DMA2SSZH_DMA2SSZ8_POSITION                         0x0
#define _DMA2SSZH_DMA2SSZ8_SIZE                             0x1
#define _DMA2SSZH_DMA2SSZ8_LENGTH                           0x1
#define _DMA2SSZH_DMA2SSZ8_MASK                             0x1
#define _DMA2SSZH_DMA2SSZ9_POSN                             0x1
#define _DMA2SSZH_DMA2SSZ9_POSITION                         0x1
#define _DMA2SSZH_DMA2SSZ9_SIZE                             0x1
#define _DMA2SSZH_DMA2SSZ9_LENGTH                           0x1
#define _DMA2SSZH_DMA2SSZ9_MASK                             0x2
#define _DMA2SSZH_DMA2SSZ10_POSN                            0x2
#define _DMA2SSZH_DMA2SSZ10_POSITION                        0x2
#define _DMA2SSZH_DMA2SSZ10_SIZE                            0x1
#define _DMA2SSZH_DMA2SSZ10_LENGTH                          0x1
#define _DMA2SSZH_DMA2SSZ10_MASK                            0x4
#define _DMA2SSZH_DMA2SSZ11_POSN                            0x3
#define _DMA2SSZH_DMA2SSZ11_POSITION                        0x3
#define _DMA2SSZH_DMA2SSZ11_SIZE                            0x1
#define _DMA2SSZH_DMA2SSZ11_LENGTH                          0x1
#define _DMA2SSZH_DMA2SSZ11_MASK                            0x8

// Register: DMA2SSA
#define DMA2SSA DMA2SSA
#ifndef __CCI__
extern volatile __uint24                DMA2SSA             __at(0x3BD9);
#endif
#ifndef _LIB_BUILD
asm("DMA2SSA equ 03BD9h");
#endif

// Register: DMA2SSAL
#define DMA2SSAL DMA2SSAL
extern volatile unsigned char           DMA2SSAL            __at(0x3BD9);
#ifndef _LIB_BUILD
asm("DMA2SSAL equ 03BD9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA0                   :1;
        unsigned SSA1                   :1;
        unsigned SSA2                   :1;
        unsigned SSA3                   :1;
        unsigned SSA4                   :1;
        unsigned SSA5                   :1;
        unsigned SSA6                   :1;
        unsigned SSA7                   :1;
    };
    struct {
        unsigned DMA2SSA                :8;
    };
    struct {
        unsigned DMA2SSA0               :1;
        unsigned DMA2SSA1               :1;
        unsigned DMA2SSA2               :1;
        unsigned DMA2SSA3               :1;
        unsigned DMA2SSA4               :1;
        unsigned DMA2SSA5               :1;
        unsigned DMA2SSA6               :1;
        unsigned DMA2SSA7               :1;
    };
} DMA2SSALbits_t;
extern volatile DMA2SSALbits_t DMA2SSALbits __at(0x3BD9);
// bitfield macros
#define _DMA2SSAL_SSA_POSN                                  0x0
#define _DMA2SSAL_SSA_POSITION                              0x0
#define _DMA2SSAL_SSA_SIZE                                  0x8
#define _DMA2SSAL_SSA_LENGTH                                0x8
#define _DMA2SSAL_SSA_MASK                                  0xFF
#define _DMA2SSAL_SSA0_POSN                                 0x0
#define _DMA2SSAL_SSA0_POSITION                             0x0
#define _DMA2SSAL_SSA0_SIZE                                 0x1
#define _DMA2SSAL_SSA0_LENGTH                               0x1
#define _DMA2SSAL_SSA0_MASK                                 0x1
#define _DMA2SSAL_SSA1_POSN                                 0x1
#define _DMA2SSAL_SSA1_POSITION                             0x1
#define _DMA2SSAL_SSA1_SIZE                                 0x1
#define _DMA2SSAL_SSA1_LENGTH                               0x1
#define _DMA2SSAL_SSA1_MASK                                 0x2
#define _DMA2SSAL_SSA2_POSN                                 0x2
#define _DMA2SSAL_SSA2_POSITION                             0x2
#define _DMA2SSAL_SSA2_SIZE                                 0x1
#define _DMA2SSAL_SSA2_LENGTH                               0x1
#define _DMA2SSAL_SSA2_MASK                                 0x4
#define _DMA2SSAL_SSA3_POSN                                 0x3
#define _DMA2SSAL_SSA3_POSITION                             0x3
#define _DMA2SSAL_SSA3_SIZE                                 0x1
#define _DMA2SSAL_SSA3_LENGTH                               0x1
#define _DMA2SSAL_SSA3_MASK                                 0x8
#define _DMA2SSAL_SSA4_POSN                                 0x4
#define _DMA2SSAL_SSA4_POSITION                             0x4
#define _DMA2SSAL_SSA4_SIZE                                 0x1
#define _DMA2SSAL_SSA4_LENGTH                               0x1
#define _DMA2SSAL_SSA4_MASK                                 0x10
#define _DMA2SSAL_SSA5_POSN                                 0x5
#define _DMA2SSAL_SSA5_POSITION                             0x5
#define _DMA2SSAL_SSA5_SIZE                                 0x1
#define _DMA2SSAL_SSA5_LENGTH                               0x1
#define _DMA2SSAL_SSA5_MASK                                 0x20
#define _DMA2SSAL_SSA6_POSN                                 0x6
#define _DMA2SSAL_SSA6_POSITION                             0x6
#define _DMA2SSAL_SSA6_SIZE                                 0x1
#define _DMA2SSAL_SSA6_LENGTH                               0x1
#define _DMA2SSAL_SSA6_MASK                                 0x40
#define _DMA2SSAL_SSA7_POSN                                 0x7
#define _DMA2SSAL_SSA7_POSITION                             0x7
#define _DMA2SSAL_SSA7_SIZE                                 0x1
#define _DMA2SSAL_SSA7_LENGTH                               0x1
#define _DMA2SSAL_SSA7_MASK                                 0x80
#define _DMA2SSAL_DMA2SSA_POSN                              0x0
#define _DMA2SSAL_DMA2SSA_POSITION                          0x0
#define _DMA2SSAL_DMA2SSA_SIZE                              0x8
#define _DMA2SSAL_DMA2SSA_LENGTH                            0x8
#define _DMA2SSAL_DMA2SSA_MASK                              0xFF
#define _DMA2SSAL_DMA2SSA0_POSN                             0x0
#define _DMA2SSAL_DMA2SSA0_POSITION                         0x0
#define _DMA2SSAL_DMA2SSA0_SIZE                             0x1
#define _DMA2SSAL_DMA2SSA0_LENGTH                           0x1
#define _DMA2SSAL_DMA2SSA0_MASK                             0x1
#define _DMA2SSAL_DMA2SSA1_POSN                             0x1
#define _DMA2SSAL_DMA2SSA1_POSITION                         0x1
#define _DMA2SSAL_DMA2SSA1_SIZE                             0x1
#define _DMA2SSAL_DMA2SSA1_LENGTH                           0x1
#define _DMA2SSAL_DMA2SSA1_MASK                             0x2
#define _DMA2SSAL_DMA2SSA2_POSN                             0x2
#define _DMA2SSAL_DMA2SSA2_POSITION                         0x2
#define _DMA2SSAL_DMA2SSA2_SIZE                             0x1
#define _DMA2SSAL_DMA2SSA2_LENGTH                           0x1
#define _DMA2SSAL_DMA2SSA2_MASK                             0x4
#define _DMA2SSAL_DMA2SSA3_POSN                             0x3
#define _DMA2SSAL_DMA2SSA3_POSITION                         0x3
#define _DMA2SSAL_DMA2SSA3_SIZE                             0x1
#define _DMA2SSAL_DMA2SSA3_LENGTH                           0x1
#define _DMA2SSAL_DMA2SSA3_MASK                             0x8
#define _DMA2SSAL_DMA2SSA4_POSN                             0x4
#define _DMA2SSAL_DMA2SSA4_POSITION                         0x4
#define _DMA2SSAL_DMA2SSA4_SIZE                             0x1
#define _DMA2SSAL_DMA2SSA4_LENGTH                           0x1
#define _DMA2SSAL_DMA2SSA4_MASK                             0x10
#define _DMA2SSAL_DMA2SSA5_POSN                             0x5
#define _DMA2SSAL_DMA2SSA5_POSITION                         0x5
#define _DMA2SSAL_DMA2SSA5_SIZE                             0x1
#define _DMA2SSAL_DMA2SSA5_LENGTH                           0x1
#define _DMA2SSAL_DMA2SSA5_MASK                             0x20
#define _DMA2SSAL_DMA2SSA6_POSN                             0x6
#define _DMA2SSAL_DMA2SSA6_POSITION                         0x6
#define _DMA2SSAL_DMA2SSA6_SIZE                             0x1
#define _DMA2SSAL_DMA2SSA6_LENGTH                           0x1
#define _DMA2SSAL_DMA2SSA6_MASK                             0x40
#define _DMA2SSAL_DMA2SSA7_POSN                             0x7
#define _DMA2SSAL_DMA2SSA7_POSITION                         0x7
#define _DMA2SSAL_DMA2SSA7_SIZE                             0x1
#define _DMA2SSAL_DMA2SSA7_LENGTH                           0x1
#define _DMA2SSAL_DMA2SSA7_MASK                             0x80

// Register: DMA2SSAH
#define DMA2SSAH DMA2SSAH
extern volatile unsigned char           DMA2SSAH            __at(0x3BDA);
#ifndef _LIB_BUILD
asm("DMA2SSAH equ 03BDAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA8                   :1;
        unsigned SSA9                   :1;
        unsigned SSA10                  :1;
        unsigned SSA11                  :1;
        unsigned SSA12                  :1;
        unsigned SSA13                  :1;
        unsigned SSA14                  :1;
        unsigned SSA15                  :1;
    };
    struct {
        unsigned DMA2SSA                :8;
    };
    struct {
        unsigned DMA2SSA8               :1;
        unsigned DMA2SSA9               :1;
        unsigned DMA2SSA10              :1;
        unsigned DMA2SSA11              :1;
        unsigned DMA2SSA12              :1;
        unsigned DMA2SSA13              :1;
        unsigned DMA2SSA14              :1;
        unsigned DMA2SSA15              :1;
    };
} DMA2SSAHbits_t;
extern volatile DMA2SSAHbits_t DMA2SSAHbits __at(0x3BDA);
// bitfield macros
#define _DMA2SSAH_SSA_POSN                                  0x0
#define _DMA2SSAH_SSA_POSITION                              0x0
#define _DMA2SSAH_SSA_SIZE                                  0x8
#define _DMA2SSAH_SSA_LENGTH                                0x8
#define _DMA2SSAH_SSA_MASK                                  0xFF
#define _DMA2SSAH_SSA8_POSN                                 0x0
#define _DMA2SSAH_SSA8_POSITION                             0x0
#define _DMA2SSAH_SSA8_SIZE                                 0x1
#define _DMA2SSAH_SSA8_LENGTH                               0x1
#define _DMA2SSAH_SSA8_MASK                                 0x1
#define _DMA2SSAH_SSA9_POSN                                 0x1
#define _DMA2SSAH_SSA9_POSITION                             0x1
#define _DMA2SSAH_SSA9_SIZE                                 0x1
#define _DMA2SSAH_SSA9_LENGTH                               0x1
#define _DMA2SSAH_SSA9_MASK                                 0x2
#define _DMA2SSAH_SSA10_POSN                                0x2
#define _DMA2SSAH_SSA10_POSITION                            0x2
#define _DMA2SSAH_SSA10_SIZE                                0x1
#define _DMA2SSAH_SSA10_LENGTH                              0x1
#define _DMA2SSAH_SSA10_MASK                                0x4
#define _DMA2SSAH_SSA11_POSN                                0x3
#define _DMA2SSAH_SSA11_POSITION                            0x3
#define _DMA2SSAH_SSA11_SIZE                                0x1
#define _DMA2SSAH_SSA11_LENGTH                              0x1
#define _DMA2SSAH_SSA11_MASK                                0x8
#define _DMA2SSAH_SSA12_POSN                                0x4
#define _DMA2SSAH_SSA12_POSITION                            0x4
#define _DMA2SSAH_SSA12_SIZE                                0x1
#define _DMA2SSAH_SSA12_LENGTH                              0x1
#define _DMA2SSAH_SSA12_MASK                                0x10
#define _DMA2SSAH_SSA13_POSN                                0x5
#define _DMA2SSAH_SSA13_POSITION                            0x5
#define _DMA2SSAH_SSA13_SIZE                                0x1
#define _DMA2SSAH_SSA13_LENGTH                              0x1
#define _DMA2SSAH_SSA13_MASK                                0x20
#define _DMA2SSAH_SSA14_POSN                                0x6
#define _DMA2SSAH_SSA14_POSITION                            0x6
#define _DMA2SSAH_SSA14_SIZE                                0x1
#define _DMA2SSAH_SSA14_LENGTH                              0x1
#define _DMA2SSAH_SSA14_MASK                                0x40
#define _DMA2SSAH_SSA15_POSN                                0x7
#define _DMA2SSAH_SSA15_POSITION                            0x7
#define _DMA2SSAH_SSA15_SIZE                                0x1
#define _DMA2SSAH_SSA15_LENGTH                              0x1
#define _DMA2SSAH_SSA15_MASK                                0x80
#define _DMA2SSAH_DMA2SSA_POSN                              0x0
#define _DMA2SSAH_DMA2SSA_POSITION                          0x0
#define _DMA2SSAH_DMA2SSA_SIZE                              0x8
#define _DMA2SSAH_DMA2SSA_LENGTH                            0x8
#define _DMA2SSAH_DMA2SSA_MASK                              0xFF
#define _DMA2SSAH_DMA2SSA8_POSN                             0x0
#define _DMA2SSAH_DMA2SSA8_POSITION                         0x0
#define _DMA2SSAH_DMA2SSA8_SIZE                             0x1
#define _DMA2SSAH_DMA2SSA8_LENGTH                           0x1
#define _DMA2SSAH_DMA2SSA8_MASK                             0x1
#define _DMA2SSAH_DMA2SSA9_POSN                             0x1
#define _DMA2SSAH_DMA2SSA9_POSITION                         0x1
#define _DMA2SSAH_DMA2SSA9_SIZE                             0x1
#define _DMA2SSAH_DMA2SSA9_LENGTH                           0x1
#define _DMA2SSAH_DMA2SSA9_MASK                             0x2
#define _DMA2SSAH_DMA2SSA10_POSN                            0x2
#define _DMA2SSAH_DMA2SSA10_POSITION                        0x2
#define _DMA2SSAH_DMA2SSA10_SIZE                            0x1
#define _DMA2SSAH_DMA2SSA10_LENGTH                          0x1
#define _DMA2SSAH_DMA2SSA10_MASK                            0x4
#define _DMA2SSAH_DMA2SSA11_POSN                            0x3
#define _DMA2SSAH_DMA2SSA11_POSITION                        0x3
#define _DMA2SSAH_DMA2SSA11_SIZE                            0x1
#define _DMA2SSAH_DMA2SSA11_LENGTH                          0x1
#define _DMA2SSAH_DMA2SSA11_MASK                            0x8
#define _DMA2SSAH_DMA2SSA12_POSN                            0x4
#define _DMA2SSAH_DMA2SSA12_POSITION                        0x4
#define _DMA2SSAH_DMA2SSA12_SIZE                            0x1
#define _DMA2SSAH_DMA2SSA12_LENGTH                          0x1
#define _DMA2SSAH_DMA2SSA12_MASK                            0x10
#define _DMA2SSAH_DMA2SSA13_POSN                            0x5
#define _DMA2SSAH_DMA2SSA13_POSITION                        0x5
#define _DMA2SSAH_DMA2SSA13_SIZE                            0x1
#define _DMA2SSAH_DMA2SSA13_LENGTH                          0x1
#define _DMA2SSAH_DMA2SSA13_MASK                            0x20
#define _DMA2SSAH_DMA2SSA14_POSN                            0x6
#define _DMA2SSAH_DMA2SSA14_POSITION                        0x6
#define _DMA2SSAH_DMA2SSA14_SIZE                            0x1
#define _DMA2SSAH_DMA2SSA14_LENGTH                          0x1
#define _DMA2SSAH_DMA2SSA14_MASK                            0x40
#define _DMA2SSAH_DMA2SSA15_POSN                            0x7
#define _DMA2SSAH_DMA2SSA15_POSITION                        0x7
#define _DMA2SSAH_DMA2SSA15_SIZE                            0x1
#define _DMA2SSAH_DMA2SSA15_LENGTH                          0x1
#define _DMA2SSAH_DMA2SSA15_MASK                            0x80

// Register: DMA2SSAU
#define DMA2SSAU DMA2SSAU
extern volatile unsigned char           DMA2SSAU            __at(0x3BDB);
#ifndef _LIB_BUILD
asm("DMA2SSAU equ 03BDBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :6;
    };
    struct {
        unsigned SSA16                  :1;
        unsigned SSA17                  :1;
        unsigned SSA18                  :1;
        unsigned SSA19                  :1;
        unsigned SSA20                  :1;
        unsigned SSA21                  :1;
    };
    struct {
        unsigned DMA2SSA                :6;
    };
    struct {
        unsigned DMA2SSA16              :1;
        unsigned DMA2SSA17              :1;
        unsigned DMA2SSA18              :1;
        unsigned DMA2SSA19              :1;
        unsigned DMA2SSA20              :1;
        unsigned DMA2SSA21              :1;
    };
} DMA2SSAUbits_t;
extern volatile DMA2SSAUbits_t DMA2SSAUbits __at(0x3BDB);
// bitfield macros
#define _DMA2SSAU_SSA_POSN                                  0x0
#define _DMA2SSAU_SSA_POSITION                              0x0
#define _DMA2SSAU_SSA_SIZE                                  0x6
#define _DMA2SSAU_SSA_LENGTH                                0x6
#define _DMA2SSAU_SSA_MASK                                  0x3F
#define _DMA2SSAU_SSA16_POSN                                0x0
#define _DMA2SSAU_SSA16_POSITION                            0x0
#define _DMA2SSAU_SSA16_SIZE                                0x1
#define _DMA2SSAU_SSA16_LENGTH                              0x1
#define _DMA2SSAU_SSA16_MASK                                0x1
#define _DMA2SSAU_SSA17_POSN                                0x1
#define _DMA2SSAU_SSA17_POSITION                            0x1
#define _DMA2SSAU_SSA17_SIZE                                0x1
#define _DMA2SSAU_SSA17_LENGTH                              0x1
#define _DMA2SSAU_SSA17_MASK                                0x2
#define _DMA2SSAU_SSA18_POSN                                0x2
#define _DMA2SSAU_SSA18_POSITION                            0x2
#define _DMA2SSAU_SSA18_SIZE                                0x1
#define _DMA2SSAU_SSA18_LENGTH                              0x1
#define _DMA2SSAU_SSA18_MASK                                0x4
#define _DMA2SSAU_SSA19_POSN                                0x3
#define _DMA2SSAU_SSA19_POSITION                            0x3
#define _DMA2SSAU_SSA19_SIZE                                0x1
#define _DMA2SSAU_SSA19_LENGTH                              0x1
#define _DMA2SSAU_SSA19_MASK                                0x8
#define _DMA2SSAU_SSA20_POSN                                0x4
#define _DMA2SSAU_SSA20_POSITION                            0x4
#define _DMA2SSAU_SSA20_SIZE                                0x1
#define _DMA2SSAU_SSA20_LENGTH                              0x1
#define _DMA2SSAU_SSA20_MASK                                0x10
#define _DMA2SSAU_SSA21_POSN                                0x5
#define _DMA2SSAU_SSA21_POSITION                            0x5
#define _DMA2SSAU_SSA21_SIZE                                0x1
#define _DMA2SSAU_SSA21_LENGTH                              0x1
#define _DMA2SSAU_SSA21_MASK                                0x20
#define _DMA2SSAU_DMA2SSA_POSN                              0x0
#define _DMA2SSAU_DMA2SSA_POSITION                          0x0
#define _DMA2SSAU_DMA2SSA_SIZE                              0x6
#define _DMA2SSAU_DMA2SSA_LENGTH                            0x6
#define _DMA2SSAU_DMA2SSA_MASK                              0x3F
#define _DMA2SSAU_DMA2SSA16_POSN                            0x0
#define _DMA2SSAU_DMA2SSA16_POSITION                        0x0
#define _DMA2SSAU_DMA2SSA16_SIZE                            0x1
#define _DMA2SSAU_DMA2SSA16_LENGTH                          0x1
#define _DMA2SSAU_DMA2SSA16_MASK                            0x1
#define _DMA2SSAU_DMA2SSA17_POSN                            0x1
#define _DMA2SSAU_DMA2SSA17_POSITION                        0x1
#define _DMA2SSAU_DMA2SSA17_SIZE                            0x1
#define _DMA2SSAU_DMA2SSA17_LENGTH                          0x1
#define _DMA2SSAU_DMA2SSA17_MASK                            0x2
#define _DMA2SSAU_DMA2SSA18_POSN                            0x2
#define _DMA2SSAU_DMA2SSA18_POSITION                        0x2
#define _DMA2SSAU_DMA2SSA18_SIZE                            0x1
#define _DMA2SSAU_DMA2SSA18_LENGTH                          0x1
#define _DMA2SSAU_DMA2SSA18_MASK                            0x4
#define _DMA2SSAU_DMA2SSA19_POSN                            0x3
#define _DMA2SSAU_DMA2SSA19_POSITION                        0x3
#define _DMA2SSAU_DMA2SSA19_SIZE                            0x1
#define _DMA2SSAU_DMA2SSA19_LENGTH                          0x1
#define _DMA2SSAU_DMA2SSA19_MASK                            0x8
#define _DMA2SSAU_DMA2SSA20_POSN                            0x4
#define _DMA2SSAU_DMA2SSA20_POSITION                        0x4
#define _DMA2SSAU_DMA2SSA20_SIZE                            0x1
#define _DMA2SSAU_DMA2SSA20_LENGTH                          0x1
#define _DMA2SSAU_DMA2SSA20_MASK                            0x10
#define _DMA2SSAU_DMA2SSA21_POSN                            0x5
#define _DMA2SSAU_DMA2SSA21_POSITION                        0x5
#define _DMA2SSAU_DMA2SSA21_SIZE                            0x1
#define _DMA2SSAU_DMA2SSA21_LENGTH                          0x1
#define _DMA2SSAU_DMA2SSA21_MASK                            0x20

