GopalSaraf/Practicals/PSDL/include/proc/pic18f24k42.h
extern volatile DMA1AIRQbits_t DMA1AIRQbits __at(0x3BFE);
// bitfield macros
#define _DMA1AIRQ_AIRQ_POSN                                 0x0
#define _DMA1AIRQ_AIRQ_POSITION                             0x0
#define _DMA1AIRQ_AIRQ_SIZE                                 0x8
#define _DMA1AIRQ_AIRQ_LENGTH                               0x8
#define _DMA1AIRQ_AIRQ_MASK                                 0xFF
#define _DMA1AIRQ_DMA1AIRQ_POSN                             0x0
#define _DMA1AIRQ_DMA1AIRQ_POSITION                         0x0
#define _DMA1AIRQ_DMA1AIRQ_SIZE                             0x8
#define _DMA1AIRQ_DMA1AIRQ_LENGTH                           0x8
#define _DMA1AIRQ_DMA1AIRQ_MASK                             0xFF
#define _DMA1AIRQ_AIRQ0_POSN                                0x0
#define _DMA1AIRQ_AIRQ0_POSITION                            0x0
#define _DMA1AIRQ_AIRQ0_SIZE                                0x1
#define _DMA1AIRQ_AIRQ0_LENGTH                              0x1
#define _DMA1AIRQ_AIRQ0_MASK                                0x1
#define _DMA1AIRQ_AIRQ1_POSN                                0x1
#define _DMA1AIRQ_AIRQ1_POSITION                            0x1
#define _DMA1AIRQ_AIRQ1_SIZE                                0x1
#define _DMA1AIRQ_AIRQ1_LENGTH                              0x1
#define _DMA1AIRQ_AIRQ1_MASK                                0x2
#define _DMA1AIRQ_AIRQ2_POSN                                0x2
#define _DMA1AIRQ_AIRQ2_POSITION                            0x2
#define _DMA1AIRQ_AIRQ2_SIZE                                0x1
#define _DMA1AIRQ_AIRQ2_LENGTH                              0x1
#define _DMA1AIRQ_AIRQ2_MASK                                0x4
#define _DMA1AIRQ_AIRQ3_POSN                                0x3
#define _DMA1AIRQ_AIRQ3_POSITION                            0x3
#define _DMA1AIRQ_AIRQ3_SIZE                                0x1
#define _DMA1AIRQ_AIRQ3_LENGTH                              0x1
#define _DMA1AIRQ_AIRQ3_MASK                                0x8
#define _DMA1AIRQ_AIRQ4_POSN                                0x4
#define _DMA1AIRQ_AIRQ4_POSITION                            0x4
#define _DMA1AIRQ_AIRQ4_SIZE                                0x1
#define _DMA1AIRQ_AIRQ4_LENGTH                              0x1
#define _DMA1AIRQ_AIRQ4_MASK                                0x10
#define _DMA1AIRQ_AIRQ5_POSN                                0x5
#define _DMA1AIRQ_AIRQ5_POSITION                            0x5
#define _DMA1AIRQ_AIRQ5_SIZE                                0x1
#define _DMA1AIRQ_AIRQ5_LENGTH                              0x1
#define _DMA1AIRQ_AIRQ5_MASK                                0x20
#define _DMA1AIRQ_AIRQ6_POSN                                0x6
#define _DMA1AIRQ_AIRQ6_POSITION                            0x6
#define _DMA1AIRQ_AIRQ6_SIZE                                0x1
#define _DMA1AIRQ_AIRQ6_LENGTH                              0x1
#define _DMA1AIRQ_AIRQ6_MASK                                0x40
#define _DMA1AIRQ_DMA1AIRQ0_POSN                            0x0
#define _DMA1AIRQ_DMA1AIRQ0_POSITION                        0x0
#define _DMA1AIRQ_DMA1AIRQ0_SIZE                            0x1
#define _DMA1AIRQ_DMA1AIRQ0_LENGTH                          0x1
#define _DMA1AIRQ_DMA1AIRQ0_MASK                            0x1
#define _DMA1AIRQ_DMA1AIRQ1_POSN                            0x1
#define _DMA1AIRQ_DMA1AIRQ1_POSITION                        0x1
#define _DMA1AIRQ_DMA1AIRQ1_SIZE                            0x1
#define _DMA1AIRQ_DMA1AIRQ1_LENGTH                          0x1
#define _DMA1AIRQ_DMA1AIRQ1_MASK                            0x2
#define _DMA1AIRQ_DMA1AIRQ2_POSN                            0x2
#define _DMA1AIRQ_DMA1AIRQ2_POSITION                        0x2
#define _DMA1AIRQ_DMA1AIRQ2_SIZE                            0x1
#define _DMA1AIRQ_DMA1AIRQ2_LENGTH                          0x1
#define _DMA1AIRQ_DMA1AIRQ2_MASK                            0x4
#define _DMA1AIRQ_DMA1AIRQ3_POSN                            0x3
#define _DMA1AIRQ_DMA1AIRQ3_POSITION                        0x3
#define _DMA1AIRQ_DMA1AIRQ3_SIZE                            0x1
#define _DMA1AIRQ_DMA1AIRQ3_LENGTH                          0x1
#define _DMA1AIRQ_DMA1AIRQ3_MASK                            0x8
#define _DMA1AIRQ_DMA1AIRQ4_POSN                            0x4
#define _DMA1AIRQ_DMA1AIRQ4_POSITION                        0x4
#define _DMA1AIRQ_DMA1AIRQ4_SIZE                            0x1
#define _DMA1AIRQ_DMA1AIRQ4_LENGTH                          0x1
#define _DMA1AIRQ_DMA1AIRQ4_MASK                            0x10
#define _DMA1AIRQ_DMA1AIRQ5_POSN                            0x5
#define _DMA1AIRQ_DMA1AIRQ5_POSITION                        0x5
#define _DMA1AIRQ_DMA1AIRQ5_SIZE                            0x1
#define _DMA1AIRQ_DMA1AIRQ5_LENGTH                          0x1
#define _DMA1AIRQ_DMA1AIRQ5_MASK                            0x20
#define _DMA1AIRQ_DMA1AIRQ6_POSN                            0x6
#define _DMA1AIRQ_DMA1AIRQ6_POSITION                        0x6
#define _DMA1AIRQ_DMA1AIRQ6_SIZE                            0x1
#define _DMA1AIRQ_DMA1AIRQ6_LENGTH                          0x1
#define _DMA1AIRQ_DMA1AIRQ6_MASK                            0x40

// Register: DMA1SIRQ
#define DMA1SIRQ DMA1SIRQ
extern volatile unsigned char           DMA1SIRQ            __at(0x3BFF);
#ifndef _LIB_BUILD
asm("DMA1SIRQ equ 03BFFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SIRQ                   :8;
    };
    struct {
        unsigned DMA1SIRQ               :8;
    };
    struct {
        unsigned SIRQ0                  :1;
        unsigned SIRQ1                  :1;
        unsigned SIRQ2                  :1;
        unsigned SIRQ3                  :1;
        unsigned SIRQ4                  :1;
        unsigned SIRQ5                  :1;
        unsigned SIRQ6                  :1;
    };
    struct {
        unsigned DMA1SIRQ0              :1;
        unsigned DMA1SIRQ1              :1;
        unsigned DMA1SIRQ2              :1;
        unsigned DMA1SIRQ3              :1;
        unsigned DMA1SIRQ4              :1;
        unsigned DMA1SIRQ5              :1;
        unsigned DMA1SIRQ6              :1;
    };
} DMA1SIRQbits_t;
extern volatile DMA1SIRQbits_t DMA1SIRQbits __at(0x3BFF);
// bitfield macros
#define _DMA1SIRQ_SIRQ_POSN                                 0x0
#define _DMA1SIRQ_SIRQ_POSITION                             0x0
#define _DMA1SIRQ_SIRQ_SIZE                                 0x8
#define _DMA1SIRQ_SIRQ_LENGTH                               0x8
#define _DMA1SIRQ_SIRQ_MASK                                 0xFF
#define _DMA1SIRQ_DMA1SIRQ_POSN                             0x0
#define _DMA1SIRQ_DMA1SIRQ_POSITION                         0x0
#define _DMA1SIRQ_DMA1SIRQ_SIZE                             0x8
#define _DMA1SIRQ_DMA1SIRQ_LENGTH                           0x8
#define _DMA1SIRQ_DMA1SIRQ_MASK                             0xFF
#define _DMA1SIRQ_SIRQ0_POSN                                0x0
#define _DMA1SIRQ_SIRQ0_POSITION                            0x0
#define _DMA1SIRQ_SIRQ0_SIZE                                0x1
#define _DMA1SIRQ_SIRQ0_LENGTH                              0x1
#define _DMA1SIRQ_SIRQ0_MASK                                0x1
#define _DMA1SIRQ_SIRQ1_POSN                                0x1
#define _DMA1SIRQ_SIRQ1_POSITION                            0x1
#define _DMA1SIRQ_SIRQ1_SIZE                                0x1
#define _DMA1SIRQ_SIRQ1_LENGTH                              0x1
#define _DMA1SIRQ_SIRQ1_MASK                                0x2
#define _DMA1SIRQ_SIRQ2_POSN                                0x2
#define _DMA1SIRQ_SIRQ2_POSITION                            0x2
#define _DMA1SIRQ_SIRQ2_SIZE                                0x1
#define _DMA1SIRQ_SIRQ2_LENGTH                              0x1
#define _DMA1SIRQ_SIRQ2_MASK                                0x4
#define _DMA1SIRQ_SIRQ3_POSN                                0x3
#define _DMA1SIRQ_SIRQ3_POSITION                            0x3
#define _DMA1SIRQ_SIRQ3_SIZE                                0x1
#define _DMA1SIRQ_SIRQ3_LENGTH                              0x1
#define _DMA1SIRQ_SIRQ3_MASK                                0x8
#define _DMA1SIRQ_SIRQ4_POSN                                0x4
#define _DMA1SIRQ_SIRQ4_POSITION                            0x4
#define _DMA1SIRQ_SIRQ4_SIZE                                0x1
#define _DMA1SIRQ_SIRQ4_LENGTH                              0x1
#define _DMA1SIRQ_SIRQ4_MASK                                0x10
#define _DMA1SIRQ_SIRQ5_POSN                                0x5
#define _DMA1SIRQ_SIRQ5_POSITION                            0x5
#define _DMA1SIRQ_SIRQ5_SIZE                                0x1
#define _DMA1SIRQ_SIRQ5_LENGTH                              0x1
#define _DMA1SIRQ_SIRQ5_MASK                                0x20
#define _DMA1SIRQ_SIRQ6_POSN                                0x6
#define _DMA1SIRQ_SIRQ6_POSITION                            0x6
#define _DMA1SIRQ_SIRQ6_SIZE                                0x1
#define _DMA1SIRQ_SIRQ6_LENGTH                              0x1
#define _DMA1SIRQ_SIRQ6_MASK                                0x40
#define _DMA1SIRQ_DMA1SIRQ0_POSN                            0x0
#define _DMA1SIRQ_DMA1SIRQ0_POSITION                        0x0
#define _DMA1SIRQ_DMA1SIRQ0_SIZE                            0x1
#define _DMA1SIRQ_DMA1SIRQ0_LENGTH                          0x1
#define _DMA1SIRQ_DMA1SIRQ0_MASK                            0x1
#define _DMA1SIRQ_DMA1SIRQ1_POSN                            0x1
#define _DMA1SIRQ_DMA1SIRQ1_POSITION                        0x1
#define _DMA1SIRQ_DMA1SIRQ1_SIZE                            0x1
#define _DMA1SIRQ_DMA1SIRQ1_LENGTH                          0x1
#define _DMA1SIRQ_DMA1SIRQ1_MASK                            0x2
#define _DMA1SIRQ_DMA1SIRQ2_POSN                            0x2
#define _DMA1SIRQ_DMA1SIRQ2_POSITION                        0x2
#define _DMA1SIRQ_DMA1SIRQ2_SIZE                            0x1
#define _DMA1SIRQ_DMA1SIRQ2_LENGTH                          0x1
#define _DMA1SIRQ_DMA1SIRQ2_MASK                            0x4
#define _DMA1SIRQ_DMA1SIRQ3_POSN                            0x3
#define _DMA1SIRQ_DMA1SIRQ3_POSITION                        0x3
#define _DMA1SIRQ_DMA1SIRQ3_SIZE                            0x1
#define _DMA1SIRQ_DMA1SIRQ3_LENGTH                          0x1
#define _DMA1SIRQ_DMA1SIRQ3_MASK                            0x8
#define _DMA1SIRQ_DMA1SIRQ4_POSN                            0x4
#define _DMA1SIRQ_DMA1SIRQ4_POSITION                        0x4
#define _DMA1SIRQ_DMA1SIRQ4_SIZE                            0x1
#define _DMA1SIRQ_DMA1SIRQ4_LENGTH                          0x1
#define _DMA1SIRQ_DMA1SIRQ4_MASK                            0x10
#define _DMA1SIRQ_DMA1SIRQ5_POSN                            0x5
#define _DMA1SIRQ_DMA1SIRQ5_POSITION                        0x5
#define _DMA1SIRQ_DMA1SIRQ5_SIZE                            0x1
#define _DMA1SIRQ_DMA1SIRQ5_LENGTH                          0x1
#define _DMA1SIRQ_DMA1SIRQ5_MASK                            0x20
#define _DMA1SIRQ_DMA1SIRQ6_POSN                            0x6
#define _DMA1SIRQ_DMA1SIRQ6_POSITION                        0x6
#define _DMA1SIRQ_DMA1SIRQ6_SIZE                            0x1
#define _DMA1SIRQ_DMA1SIRQ6_LENGTH                          0x1
#define _DMA1SIRQ_DMA1SIRQ6_MASK                            0x40

// Register: CLC4CON
#define CLC4CON CLC4CON
extern volatile unsigned char           CLC4CON             __at(0x3C56);
#ifndef _LIB_BUILD
asm("CLC4CON equ 03C56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned OUT                    :1;
        unsigned OE                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned LC4MODE                :3;
        unsigned LC4INTN                :1;
        unsigned LC4INTP                :1;
        unsigned LC4OUT                 :1;
        unsigned LC4OE                  :1;
        unsigned LC4EN                  :1;
    };
    struct {
        unsigned LC4MODE0               :1;
        unsigned LC4MODE1               :1;
        unsigned LC4MODE2               :1;
    };
} CLC4CONbits_t;
extern volatile CLC4CONbits_t CLC4CONbits __at(0x3C56);
// bitfield macros
#define _CLC4CON_MODE_POSN                                  0x0
#define _CLC4CON_MODE_POSITION                              0x0
#define _CLC4CON_MODE_SIZE                                  0x3
#define _CLC4CON_MODE_LENGTH                                0x3
#define _CLC4CON_MODE_MASK                                  0x7
#define _CLC4CON_INTN_POSN                                  0x3
#define _CLC4CON_INTN_POSITION                              0x3
#define _CLC4CON_INTN_SIZE                                  0x1
#define _CLC4CON_INTN_LENGTH                                0x1
#define _CLC4CON_INTN_MASK                                  0x8
#define _CLC4CON_INTP_POSN                                  0x4
#define _CLC4CON_INTP_POSITION                              0x4
#define _CLC4CON_INTP_SIZE                                  0x1
#define _CLC4CON_INTP_LENGTH                                0x1
#define _CLC4CON_INTP_MASK                                  0x10
#define _CLC4CON_OUT_POSN                                   0x5
#define _CLC4CON_OUT_POSITION                               0x5
#define _CLC4CON_OUT_SIZE                                   0x1
#define _CLC4CON_OUT_LENGTH                                 0x1
#define _CLC4CON_OUT_MASK                                   0x20
#define _CLC4CON_OE_POSN                                    0x6
#define _CLC4CON_OE_POSITION                                0x6
#define _CLC4CON_OE_SIZE                                    0x1
#define _CLC4CON_OE_LENGTH                                  0x1
#define _CLC4CON_OE_MASK                                    0x40
#define _CLC4CON_EN_POSN                                    0x7
#define _CLC4CON_EN_POSITION                                0x7
#define _CLC4CON_EN_SIZE                                    0x1
#define _CLC4CON_EN_LENGTH                                  0x1
#define _CLC4CON_EN_MASK                                    0x80
#define _CLC4CON_MODE0_POSN                                 0x0
#define _CLC4CON_MODE0_POSITION                             0x0
#define _CLC4CON_MODE0_SIZE                                 0x1
#define _CLC4CON_MODE0_LENGTH                               0x1
#define _CLC4CON_MODE0_MASK                                 0x1
#define _CLC4CON_MODE1_POSN                                 0x1
#define _CLC4CON_MODE1_POSITION                             0x1
#define _CLC4CON_MODE1_SIZE                                 0x1
#define _CLC4CON_MODE1_LENGTH                               0x1
#define _CLC4CON_MODE1_MASK                                 0x2
#define _CLC4CON_MODE2_POSN                                 0x2
#define _CLC4CON_MODE2_POSITION                             0x2
#define _CLC4CON_MODE2_SIZE                                 0x1
#define _CLC4CON_MODE2_LENGTH                               0x1
#define _CLC4CON_MODE2_MASK                                 0x4
#define _CLC4CON_LC4MODE_POSN                               0x0
#define _CLC4CON_LC4MODE_POSITION                           0x0
#define _CLC4CON_LC4MODE_SIZE                               0x3
#define _CLC4CON_LC4MODE_LENGTH                             0x3
#define _CLC4CON_LC4MODE_MASK                               0x7
#define _CLC4CON_LC4INTN_POSN                               0x3
#define _CLC4CON_LC4INTN_POSITION                           0x3
#define _CLC4CON_LC4INTN_SIZE                               0x1
#define _CLC4CON_LC4INTN_LENGTH                             0x1
#define _CLC4CON_LC4INTN_MASK                               0x8
#define _CLC4CON_LC4INTP_POSN                               0x4
#define _CLC4CON_LC4INTP_POSITION                           0x4
#define _CLC4CON_LC4INTP_SIZE                               0x1
#define _CLC4CON_LC4INTP_LENGTH                             0x1
#define _CLC4CON_LC4INTP_MASK                               0x10
#define _CLC4CON_LC4OUT_POSN                                0x5
#define _CLC4CON_LC4OUT_POSITION                            0x5
#define _CLC4CON_LC4OUT_SIZE                                0x1
#define _CLC4CON_LC4OUT_LENGTH                              0x1
#define _CLC4CON_LC4OUT_MASK                                0x20
#define _CLC4CON_LC4OE_POSN                                 0x6
#define _CLC4CON_LC4OE_POSITION                             0x6
#define _CLC4CON_LC4OE_SIZE                                 0x1
#define _CLC4CON_LC4OE_LENGTH                               0x1
#define _CLC4CON_LC4OE_MASK                                 0x40
#define _CLC4CON_LC4EN_POSN                                 0x7
#define _CLC4CON_LC4EN_POSITION                             0x7
#define _CLC4CON_LC4EN_SIZE                                 0x1
#define _CLC4CON_LC4EN_LENGTH                               0x1
#define _CLC4CON_LC4EN_MASK                                 0x80
#define _CLC4CON_LC4MODE0_POSN                              0x0
#define _CLC4CON_LC4MODE0_POSITION                          0x0
#define _CLC4CON_LC4MODE0_SIZE                              0x1
#define _CLC4CON_LC4MODE0_LENGTH                            0x1
#define _CLC4CON_LC4MODE0_MASK                              0x1
#define _CLC4CON_LC4MODE1_POSN                              0x1
#define _CLC4CON_LC4MODE1_POSITION                          0x1
#define _CLC4CON_LC4MODE1_SIZE                              0x1
#define _CLC4CON_LC4MODE1_LENGTH                            0x1
#define _CLC4CON_LC4MODE1_MASK                              0x2
#define _CLC4CON_LC4MODE2_POSN                              0x2
#define _CLC4CON_LC4MODE2_POSITION                          0x2
#define _CLC4CON_LC4MODE2_SIZE                              0x1
#define _CLC4CON_LC4MODE2_LENGTH                            0x1
#define _CLC4CON_LC4MODE2_MASK                              0x4

// Register: CLC4POL
#define CLC4POL CLC4POL
extern volatile unsigned char           CLC4POL             __at(0x3C57);
#ifndef _LIB_BUILD
asm("CLC4POL equ 03C57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1POL                  :1;
        unsigned G2POL                  :1;
        unsigned G3POL                  :1;
        unsigned G4POL                  :1;
        unsigned                        :3;
        unsigned POL                    :1;
    };
    struct {
        unsigned LC4G1POL               :1;
        unsigned LC4G2POL               :1;
        unsigned LC4G3POL               :1;
        unsigned LC4G4POL               :1;
        unsigned                        :3;
        unsigned LC4POL                 :1;
    };
} CLC4POLbits_t;
extern volatile CLC4POLbits_t CLC4POLbits __at(0x3C57);
// bitfield macros
#define _CLC4POL_G1POL_POSN                                 0x0
#define _CLC4POL_G1POL_POSITION                             0x0
#define _CLC4POL_G1POL_SIZE                                 0x1
#define _CLC4POL_G1POL_LENGTH                               0x1
#define _CLC4POL_G1POL_MASK                                 0x1
#define _CLC4POL_G2POL_POSN                                 0x1
#define _CLC4POL_G2POL_POSITION                             0x1
#define _CLC4POL_G2POL_SIZE                                 0x1
#define _CLC4POL_G2POL_LENGTH                               0x1
#define _CLC4POL_G2POL_MASK                                 0x2
#define _CLC4POL_G3POL_POSN                                 0x2
#define _CLC4POL_G3POL_POSITION                             0x2
#define _CLC4POL_G3POL_SIZE                                 0x1
#define _CLC4POL_G3POL_LENGTH                               0x1
#define _CLC4POL_G3POL_MASK                                 0x4
#define _CLC4POL_G4POL_POSN                                 0x3
#define _CLC4POL_G4POL_POSITION                             0x3
#define _CLC4POL_G4POL_SIZE                                 0x1
#define _CLC4POL_G4POL_LENGTH                               0x1
#define _CLC4POL_G4POL_MASK                                 0x8
#define _CLC4POL_POL_POSN                                   0x7
#define _CLC4POL_POL_POSITION                               0x7
#define _CLC4POL_POL_SIZE                                   0x1
#define _CLC4POL_POL_LENGTH                                 0x1
#define _CLC4POL_POL_MASK                                   0x80
#define _CLC4POL_LC4G1POL_POSN                              0x0
#define _CLC4POL_LC4G1POL_POSITION                          0x0
#define _CLC4POL_LC4G1POL_SIZE                              0x1
#define _CLC4POL_LC4G1POL_LENGTH                            0x1
#define _CLC4POL_LC4G1POL_MASK                              0x1
#define _CLC4POL_LC4G2POL_POSN                              0x1
#define _CLC4POL_LC4G2POL_POSITION                          0x1
#define _CLC4POL_LC4G2POL_SIZE                              0x1
#define _CLC4POL_LC4G2POL_LENGTH                            0x1
#define _CLC4POL_LC4G2POL_MASK                              0x2
#define _CLC4POL_LC4G3POL_POSN                              0x2
#define _CLC4POL_LC4G3POL_POSITION                          0x2
#define _CLC4POL_LC4G3POL_SIZE                              0x1
#define _CLC4POL_LC4G3POL_LENGTH                            0x1
#define _CLC4POL_LC4G3POL_MASK                              0x4
#define _CLC4POL_LC4G4POL_POSN                              0x3
#define _CLC4POL_LC4G4POL_POSITION                          0x3
#define _CLC4POL_LC4G4POL_SIZE                              0x1
#define _CLC4POL_LC4G4POL_LENGTH                            0x1
#define _CLC4POL_LC4G4POL_MASK                              0x8
#define _CLC4POL_LC4POL_POSN                                0x7
#define _CLC4POL_LC4POL_POSITION                            0x7
#define _CLC4POL_LC4POL_SIZE                                0x1
#define _CLC4POL_LC4POL_LENGTH                              0x1
#define _CLC4POL_LC4POL_MASK                                0x80

// Register: CLC4SEL0
#define CLC4SEL0 CLC4SEL0
extern volatile unsigned char           CLC4SEL0            __at(0x3C58);
#ifndef _LIB_BUILD
asm("CLC4SEL0 equ 03C58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D1S                    :8;
    };
    struct {
        unsigned LC4D1S                 :8;
    };
    struct {
        unsigned D1S0                   :1;
        unsigned D1S1                   :1;
        unsigned D1S2                   :1;
        unsigned D1S3                   :1;
        unsigned D1S4                   :1;
        unsigned D1S5                   :1;
        unsigned D1S6                   :1;
        unsigned D1S7                   :1;
    };
    struct {
        unsigned LC4D1S0                :1;
        unsigned LC4D1S1                :1;
        unsigned LC4D1S2                :1;
        unsigned LC4D1S3                :1;
        unsigned LC4D1S4                :1;
        unsigned LC4D1S5                :1;
        unsigned LC4D1S6                :1;
        unsigned LC4D1S7                :1;
    };
} CLC4SEL0bits_t;
