GopalSaraf/Practicals/PSDL/include/proc/pic18f24k42.h
// Register: ADPCH
#define ADPCH ADPCH
extern volatile unsigned char           ADPCH               __at(0x3EF1);
#ifndef _LIB_BUILD
asm("ADPCH equ 03EF1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADPCH                  :6;
    };
    struct {
        unsigned ADPCH0                 :1;
        unsigned ADPCH1                 :1;
        unsigned ADPCH2                 :1;
        unsigned ADPCH3                 :1;
        unsigned ADPCH4                 :1;
        unsigned ADPCH5                 :1;
    };
    struct {
        unsigned PCH                    :6;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned PCH3                   :1;
        unsigned PCH4                   :1;
        unsigned PCH5                   :1;
    };
} ADPCHbits_t;
extern volatile ADPCHbits_t ADPCHbits __at(0x3EF1);
// bitfield macros
#define _ADPCH_ADPCH_POSN                                   0x0
#define _ADPCH_ADPCH_POSITION                               0x0
#define _ADPCH_ADPCH_SIZE                                   0x6
#define _ADPCH_ADPCH_LENGTH                                 0x6
#define _ADPCH_ADPCH_MASK                                   0x3F
#define _ADPCH_ADPCH0_POSN                                  0x0
#define _ADPCH_ADPCH0_POSITION                              0x0
#define _ADPCH_ADPCH0_SIZE                                  0x1
#define _ADPCH_ADPCH0_LENGTH                                0x1
#define _ADPCH_ADPCH0_MASK                                  0x1
#define _ADPCH_ADPCH1_POSN                                  0x1
#define _ADPCH_ADPCH1_POSITION                              0x1
#define _ADPCH_ADPCH1_SIZE                                  0x1
#define _ADPCH_ADPCH1_LENGTH                                0x1
#define _ADPCH_ADPCH1_MASK                                  0x2
#define _ADPCH_ADPCH2_POSN                                  0x2
#define _ADPCH_ADPCH2_POSITION                              0x2
#define _ADPCH_ADPCH2_SIZE                                  0x1
#define _ADPCH_ADPCH2_LENGTH                                0x1
#define _ADPCH_ADPCH2_MASK                                  0x4
#define _ADPCH_ADPCH3_POSN                                  0x3
#define _ADPCH_ADPCH3_POSITION                              0x3
#define _ADPCH_ADPCH3_SIZE                                  0x1
#define _ADPCH_ADPCH3_LENGTH                                0x1
#define _ADPCH_ADPCH3_MASK                                  0x8
#define _ADPCH_ADPCH4_POSN                                  0x4
#define _ADPCH_ADPCH4_POSITION                              0x4
#define _ADPCH_ADPCH4_SIZE                                  0x1
#define _ADPCH_ADPCH4_LENGTH                                0x1
#define _ADPCH_ADPCH4_MASK                                  0x10
#define _ADPCH_ADPCH5_POSN                                  0x5
#define _ADPCH_ADPCH5_POSITION                              0x5
#define _ADPCH_ADPCH5_SIZE                                  0x1
#define _ADPCH_ADPCH5_LENGTH                                0x1
#define _ADPCH_ADPCH5_MASK                                  0x20
#define _ADPCH_PCH_POSN                                     0x0
#define _ADPCH_PCH_POSITION                                 0x0
#define _ADPCH_PCH_SIZE                                     0x6
#define _ADPCH_PCH_LENGTH                                   0x6
#define _ADPCH_PCH_MASK                                     0x3F
#define _ADPCH_PCH0_POSN                                    0x0
#define _ADPCH_PCH0_POSITION                                0x0
#define _ADPCH_PCH0_SIZE                                    0x1
#define _ADPCH_PCH0_LENGTH                                  0x1
#define _ADPCH_PCH0_MASK                                    0x1
#define _ADPCH_PCH1_POSN                                    0x1
#define _ADPCH_PCH1_POSITION                                0x1
#define _ADPCH_PCH1_SIZE                                    0x1
#define _ADPCH_PCH1_LENGTH                                  0x1
#define _ADPCH_PCH1_MASK                                    0x2
#define _ADPCH_PCH2_POSN                                    0x2
#define _ADPCH_PCH2_POSITION                                0x2
#define _ADPCH_PCH2_SIZE                                    0x1
#define _ADPCH_PCH2_LENGTH                                  0x1
#define _ADPCH_PCH2_MASK                                    0x4
#define _ADPCH_PCH3_POSN                                    0x3
#define _ADPCH_PCH3_POSITION                                0x3
#define _ADPCH_PCH3_SIZE                                    0x1
#define _ADPCH_PCH3_LENGTH                                  0x1
#define _ADPCH_PCH3_MASK                                    0x8
#define _ADPCH_PCH4_POSN                                    0x4
#define _ADPCH_PCH4_POSITION                                0x4
#define _ADPCH_PCH4_SIZE                                    0x1
#define _ADPCH_PCH4_LENGTH                                  0x1
#define _ADPCH_PCH4_MASK                                    0x10
#define _ADPCH_PCH5_POSN                                    0x5
#define _ADPCH_PCH5_POSITION                                0x5
#define _ADPCH_PCH5_SIZE                                    0x1
#define _ADPCH_PCH5_LENGTH                                  0x1
#define _ADPCH_PCH5_MASK                                    0x20

// Register: ADACQ
#define ADACQ ADACQ
extern volatile unsigned short          ADACQ               __at(0x3EF3);
#ifndef _LIB_BUILD
asm("ADACQ equ 03EF3h");
#endif

// Register: ADACQL
#define ADACQL ADACQL
extern volatile unsigned char           ADACQL              __at(0x3EF3);
#ifndef _LIB_BUILD
asm("ADACQL equ 03EF3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACQ                    :8;
    };
    struct {
        unsigned ADACQ0                 :1;
        unsigned ADACQ1                 :1;
        unsigned ADACQ2                 :1;
        unsigned ADACQ3                 :1;
        unsigned ADACQ4                 :1;
        unsigned ADACQ5                 :1;
        unsigned ADACQ6                 :1;
        unsigned ADACQ7                 :1;
    };
    struct {
        unsigned ADACQ                  :8;
    };
    struct {
        unsigned ACQ0                   :1;
        unsigned ACQ1                   :1;
        unsigned ACQ2                   :1;
        unsigned ACQ3                   :1;
        unsigned ACQ4                   :1;
        unsigned ACQ5                   :1;
        unsigned ACQ6                   :1;
        unsigned ACQ7                   :1;
    };
} ADACQLbits_t;
