GopalSaraf/Practicals/PSDL/include/proc/pic18f24k42.h
extern volatile __bit                   CWG1LSAC1           __at(0x1FAC3);	// @ (0x3F58 * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0x1FAC4);	// @ (0x3F58 * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0x1FAC5);	// @ (0x3F58 * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// CWG1AS0<CWG1LSDB0>
extern volatile __bit                   CWG1LSDB0           __at(0x1FAC4);	// @ (0x3F58 * 8 + 4)
#define                                 CWG1LSDB0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSDB1>
extern volatile __bit                   CWG1LSDB1           __at(0x1FAC5);	// @ (0x3F58 * 8 + 5)
#define                                 CWG1LSDB1_bit       _BIT_ACCESS(CWG1AS0,5)
// PMD4<CWG1MD>
extern volatile __bit                   CWG1MD              __at(0x1CE25);	// @ (0x39C4 * 8 + 5)
#define                                 CWG1MD_bit          _BIT_ACCESS(PMD4,5)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0x1FAB0);	// @ (0x3F56 * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0x1FAB1);	// @ (0x3F56 * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0x1FAB2);	// @ (0x3F56 * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1STR<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0x1FAD4);	// @ (0x3F5A * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1STR,4)
// CWG1STR<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0x1FAD5);	// @ (0x3F5A * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1STR,5)
// CWG1STR<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0x1FAD6);	// @ (0x3F5A * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1STR,6)
// CWG1STR<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0x1FAD7);	// @ (0x3F5A * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1STR,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0x1FAB8);	// @ (0x3F57 * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0x1FAB9);	// @ (0x3F57 * 8 + 1)
#define                                 CWG1POLB_bit        _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<CWG1POLC>
extern volatile __bit                   CWG1POLC            __at(0x1FABA);	// @ (0x3F57 * 8 + 2)
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0x1FABB);	// @ (0x3F57 * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1STR<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0x1FAD0);	// @ (0x3F5A * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1STR,0)
// CWG1STR<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0x1FAD1);	// @ (0x3F5A * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1STR,1)
// CWG1STR<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0x1FAD2);	// @ (0x3F5A * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1STR,2)
// CWG1STR<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0x1FAD3);	// @ (0x3F5A * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1STR,3)
// CWG2CLK<CWG2CS>
extern volatile __bit                   CWG2CS              __at(0x1FA48);	// @ (0x3F49 * 8 + 0)
#define                                 CWG2CS_bit          _BIT_ACCESS(CWG2CLK,0)
// CWG2DBF<CWG2DBF0>
extern volatile __bit                   CWG2DBF0            __at(0x1FA60);	// @ (0x3F4C * 8 + 0)
#define                                 CWG2DBF0_bit        _BIT_ACCESS(CWG2DBF,0)
// CWG2DBF<CWG2DBF1>
extern volatile __bit                   CWG2DBF1            __at(0x1FA61);	// @ (0x3F4C * 8 + 1)
#define                                 CWG2DBF1_bit        _BIT_ACCESS(CWG2DBF,1)
// CWG2DBF<CWG2DBF2>
extern volatile __bit                   CWG2DBF2            __at(0x1FA62);	// @ (0x3F4C * 8 + 2)
#define                                 CWG2DBF2_bit        _BIT_ACCESS(CWG2DBF,2)
// CWG2DBF<CWG2DBF3>
extern volatile __bit                   CWG2DBF3            __at(0x1FA63);	// @ (0x3F4C * 8 + 3)
#define                                 CWG2DBF3_bit        _BIT_ACCESS(CWG2DBF,3)
// CWG2DBF<CWG2DBF4>
extern volatile __bit                   CWG2DBF4            __at(0x1FA64);	// @ (0x3F4C * 8 + 4)
#define                                 CWG2DBF4_bit        _BIT_ACCESS(CWG2DBF,4)
// CWG2DBF<CWG2DBF5>
extern volatile __bit                   CWG2DBF5            __at(0x1FA65);	// @ (0x3F4C * 8 + 5)
#define                                 CWG2DBF5_bit        _BIT_ACCESS(CWG2DBF,5)
// CWG2DBR<CWG2DBR0>
extern volatile __bit                   CWG2DBR0            __at(0x1FA58);	// @ (0x3F4B * 8 + 0)
#define                                 CWG2DBR0_bit        _BIT_ACCESS(CWG2DBR,0)
// CWG2DBR<CWG2DBR1>
extern volatile __bit                   CWG2DBR1            __at(0x1FA59);	// @ (0x3F4B * 8 + 1)
#define                                 CWG2DBR1_bit        _BIT_ACCESS(CWG2DBR,1)
// CWG2DBR<CWG2DBR2>
extern volatile __bit                   CWG2DBR2            __at(0x1FA5A);	// @ (0x3F4B * 8 + 2)
#define                                 CWG2DBR2_bit        _BIT_ACCESS(CWG2DBR,2)
// CWG2DBR<CWG2DBR3>
extern volatile __bit                   CWG2DBR3            __at(0x1FA5B);	// @ (0x3F4B * 8 + 3)
#define                                 CWG2DBR3_bit        _BIT_ACCESS(CWG2DBR,3)
// CWG2DBR<CWG2DBR4>
extern volatile __bit                   CWG2DBR4            __at(0x1FA5C);	// @ (0x3F4B * 8 + 4)
#define                                 CWG2DBR4_bit        _BIT_ACCESS(CWG2DBR,4)
// CWG2DBR<CWG2DBR5>
extern volatile __bit                   CWG2DBR5            __at(0x1FA5D);	// @ (0x3F4B * 8 + 5)
#define                                 CWG2DBR5_bit        _BIT_ACCESS(CWG2DBR,5)
// CWG2CON0<CWG2EN>
extern volatile __bit                   CWG2EN              __at(0x1FA6F);	// @ (0x3F4D * 8 + 7)
#define                                 CWG2EN_bit          _BIT_ACCESS(CWG2CON0,7)
// PIE7<CWG2IE>
extern volatile __bit                   CWG2IE              __at(0x1CCBB);	// @ (0x3997 * 8 + 3)
#define                                 CWG2IE_bit          _BIT_ACCESS(PIE7,3)
// PIR7<CWG2IF>
extern volatile __bit                   CWG2IF              __at(0x1CD3B);	// @ (0x39A7 * 8 + 3)
#define                                 CWG2IF_bit          _BIT_ACCESS(PIR7,3)
// CWG2CON1<CWG2IN>
extern volatile __bit                   CWG2IN              __at(0x1FA75);	// @ (0x3F4E * 8 + 5)
#define                                 CWG2IN_bit          _BIT_ACCESS(CWG2CON1,5)
// IPR7<CWG2IP>
extern volatile __bit                   CWG2IP              __at(0x1CC3B);	// @ (0x3987 * 8 + 3)
#define                                 CWG2IP_bit          _BIT_ACCESS(IPR7,3)
// CWG2CON0<CWG2LD>
extern volatile __bit                   CWG2LD              __at(0x1FA6E);	// @ (0x3F4D * 8 + 6)
#define                                 CWG2LD_bit          _BIT_ACCESS(CWG2CON0,6)
// CWG2AS0<CWG2LSAC0>
extern volatile __bit                   CWG2LSAC0           __at(0x1FA7A);	// @ (0x3F4F * 8 + 2)
#define                                 CWG2LSAC0_bit       _BIT_ACCESS(CWG2AS0,2)
// CWG2AS0<CWG2LSAC1>
extern volatile __bit                   CWG2LSAC1           __at(0x1FA7B);	// @ (0x3F4F * 8 + 3)
#define                                 CWG2LSAC1_bit       _BIT_ACCESS(CWG2AS0,3)
// CWG2AS0<CWG2LSBD0>
extern volatile __bit                   CWG2LSBD0           __at(0x1FA7C);	// @ (0x3F4F * 8 + 4)
#define                                 CWG2LSBD0_bit       _BIT_ACCESS(CWG2AS0,4)
// CWG2AS0<CWG2LSBD1>
extern volatile __bit                   CWG2LSBD1           __at(0x1FA7D);	// @ (0x3F4F * 8 + 5)
#define                                 CWG2LSBD1_bit       _BIT_ACCESS(CWG2AS0,5)
// CWG2AS0<CWG2LSDB0>
extern volatile __bit                   CWG2LSDB0           __at(0x1FA7C);	// @ (0x3F4F * 8 + 4)
#define                                 CWG2LSDB0_bit       _BIT_ACCESS(CWG2AS0,4)
// CWG2AS0<CWG2LSDB1>
extern volatile __bit                   CWG2LSDB1           __at(0x1FA7D);	// @ (0x3F4F * 8 + 5)
#define                                 CWG2LSDB1_bit       _BIT_ACCESS(CWG2AS0,5)
// PMD4<CWG2MD>
extern volatile __bit                   CWG2MD              __at(0x1CE26);	// @ (0x39C4 * 8 + 6)
#define                                 CWG2MD_bit          _BIT_ACCESS(PMD4,6)
// CWG2CON0<CWG2MODE0>
extern volatile __bit                   CWG2MODE0           __at(0x1FA68);	// @ (0x3F4D * 8 + 0)
#define                                 CWG2MODE0_bit       _BIT_ACCESS(CWG2CON0,0)
// CWG2CON0<CWG2MODE1>
extern volatile __bit                   CWG2MODE1           __at(0x1FA69);	// @ (0x3F4D * 8 + 1)
#define                                 CWG2MODE1_bit       _BIT_ACCESS(CWG2CON0,1)
// CWG2CON0<CWG2MODE2>
extern volatile __bit                   CWG2MODE2           __at(0x1FA6A);	// @ (0x3F4D * 8 + 2)
#define                                 CWG2MODE2_bit       _BIT_ACCESS(CWG2CON0,2)
// CWG2STR<CWG2OVRA>
extern volatile __bit                   CWG2OVRA            __at(0x1FA8C);	// @ (0x3F51 * 8 + 4)
#define                                 CWG2OVRA_bit        _BIT_ACCESS(CWG2STR,4)
// CWG2STR<CWG2OVRB>
extern volatile __bit                   CWG2OVRB            __at(0x1FA8D);	// @ (0x3F51 * 8 + 5)
#define                                 CWG2OVRB_bit        _BIT_ACCESS(CWG2STR,5)
// CWG2STR<CWG2OVRC>
extern volatile __bit                   CWG2OVRC            __at(0x1FA8E);	// @ (0x3F51 * 8 + 6)
#define                                 CWG2OVRC_bit        _BIT_ACCESS(CWG2STR,6)
// CWG2STR<CWG2OVRD>
extern volatile __bit                   CWG2OVRD            __at(0x1FA8F);	// @ (0x3F51 * 8 + 7)
#define                                 CWG2OVRD_bit        _BIT_ACCESS(CWG2STR,7)
// CWG2CON1<CWG2POLA>
extern volatile __bit                   CWG2POLA            __at(0x1FA70);	// @ (0x3F4E * 8 + 0)
#define                                 CWG2POLA_bit        _BIT_ACCESS(CWG2CON1,0)
// CWG2CON1<CWG2POLB>
extern volatile __bit                   CWG2POLB            __at(0x1FA71);	// @ (0x3F4E * 8 + 1)
#define                                 CWG2POLB_bit        _BIT_ACCESS(CWG2CON1,1)
// CWG2CON1<CWG2POLC>
extern volatile __bit                   CWG2POLC            __at(0x1FA72);	// @ (0x3F4E * 8 + 2)
#define                                 CWG2POLC_bit        _BIT_ACCESS(CWG2CON1,2)
// CWG2CON1<CWG2POLD>
extern volatile __bit                   CWG2POLD            __at(0x1FA73);	// @ (0x3F4E * 8 + 3)
#define                                 CWG2POLD_bit        _BIT_ACCESS(CWG2CON1,3)
// CWG2STR<CWG2STRA>
extern volatile __bit                   CWG2STRA            __at(0x1FA88);	// @ (0x3F51 * 8 + 0)
#define                                 CWG2STRA_bit        _BIT_ACCESS(CWG2STR,0)
// CWG2STR<CWG2STRB>
extern volatile __bit                   CWG2STRB            __at(0x1FA89);	// @ (0x3F51 * 8 + 1)
#define                                 CWG2STRB_bit        _BIT_ACCESS(CWG2STR,1)
// CWG2STR<CWG2STRC>
extern volatile __bit                   CWG2STRC            __at(0x1FA8A);	// @ (0x3F51 * 8 + 2)
#define                                 CWG2STRC_bit        _BIT_ACCESS(CWG2STR,2)
// CWG2STR<CWG2STRD>
extern volatile __bit                   CWG2STRD            __at(0x1FA8B);	// @ (0x3F51 * 8 + 3)
#define                                 CWG2STRD_bit        _BIT_ACCESS(CWG2STR,3)
// CWG3CLK<CWG3CS>
extern volatile __bit                   CWG3CS              __at(0x1FA00);	// @ (0x3F40 * 8 + 0)
#define                                 CWG3CS_bit          _BIT_ACCESS(CWG3CLK,0)
// CWG3DBF<CWG3DBF0>
extern volatile __bit                   CWG3DBF0            __at(0x1FA18);	// @ (0x3F43 * 8 + 0)
#define                                 CWG3DBF0_bit        _BIT_ACCESS(CWG3DBF,0)
// CWG3DBF<CWG3DBF1>
extern volatile __bit                   CWG3DBF1            __at(0x1FA19);	// @ (0x3F43 * 8 + 1)
#define                                 CWG3DBF1_bit        _BIT_ACCESS(CWG3DBF,1)
// CWG3DBF<CWG3DBF2>
extern volatile __bit                   CWG3DBF2            __at(0x1FA1A);	// @ (0x3F43 * 8 + 2)
#define                                 CWG3DBF2_bit        _BIT_ACCESS(CWG3DBF,2)
// CWG3DBF<CWG3DBF3>
extern volatile __bit                   CWG3DBF3            __at(0x1FA1B);	// @ (0x3F43 * 8 + 3)
#define                                 CWG3DBF3_bit        _BIT_ACCESS(CWG3DBF,3)
// CWG3DBF<CWG3DBF4>
extern volatile __bit                   CWG3DBF4            __at(0x1FA1C);	// @ (0x3F43 * 8 + 4)
#define                                 CWG3DBF4_bit        _BIT_ACCESS(CWG3DBF,4)
// CWG3DBF<CWG3DBF5>
extern volatile __bit                   CWG3DBF5            __at(0x1FA1D);	// @ (0x3F43 * 8 + 5)
#define                                 CWG3DBF5_bit        _BIT_ACCESS(CWG3DBF,5)
// CWG3DBR<CWG3DBR0>
extern volatile __bit                   CWG3DBR0            __at(0x1FA10);	// @ (0x3F42 * 8 + 0)
#define                                 CWG3DBR0_bit        _BIT_ACCESS(CWG3DBR,0)
// CWG3DBR<CWG3DBR1>
extern volatile __bit                   CWG3DBR1            __at(0x1FA11);	// @ (0x3F42 * 8 + 1)
#define                                 CWG3DBR1_bit        _BIT_ACCESS(CWG3DBR,1)
// CWG3DBR<CWG3DBR2>
extern volatile __bit                   CWG3DBR2            __at(0x1FA12);	// @ (0x3F42 * 8 + 2)
#define                                 CWG3DBR2_bit        _BIT_ACCESS(CWG3DBR,2)
// CWG3DBR<CWG3DBR3>
extern volatile __bit                   CWG3DBR3            __at(0x1FA13);	// @ (0x3F42 * 8 + 3)
#define                                 CWG3DBR3_bit        _BIT_ACCESS(CWG3DBR,3)
// CWG3DBR<CWG3DBR4>
extern volatile __bit                   CWG3DBR4            __at(0x1FA14);	// @ (0x3F42 * 8 + 4)
#define                                 CWG3DBR4_bit        _BIT_ACCESS(CWG3DBR,4)
// CWG3DBR<CWG3DBR5>
extern volatile __bit                   CWG3DBR5            __at(0x1FA15);	// @ (0x3F42 * 8 + 5)
#define                                 CWG3DBR5_bit        _BIT_ACCESS(CWG3DBR,5)
// CWG3CON0<CWG3EN>
extern volatile __bit                   CWG3EN              __at(0x1FA27);	// @ (0x3F44 * 8 + 7)
#define                                 CWG3EN_bit          _BIT_ACCESS(CWG3CON0,7)
// PIE9<CWG3IE>
extern volatile __bit                   CWG3IE              __at(0x1CCCA);	// @ (0x3999 * 8 + 2)
#define                                 CWG3IE_bit          _BIT_ACCESS(PIE9,2)
// PIR9<CWG3IF>
extern volatile __bit                   CWG3IF              __at(0x1CD4A);	// @ (0x39A9 * 8 + 2)
#define                                 CWG3IF_bit          _BIT_ACCESS(PIR9,2)
// CWG3CON1<CWG3IN>
extern volatile __bit                   CWG3IN              __at(0x1FA2D);	// @ (0x3F45 * 8 + 5)
#define                                 CWG3IN_bit          _BIT_ACCESS(CWG3CON1,5)
// IPR9<CWG3IP>
extern volatile __bit                   CWG3IP              __at(0x1CC4A);	// @ (0x3989 * 8 + 2)
#define                                 CWG3IP_bit          _BIT_ACCESS(IPR9,2)
// CWG3CON0<CWG3LD>
extern volatile __bit                   CWG3LD              __at(0x1FA26);	// @ (0x3F44 * 8 + 6)
#define                                 CWG3LD_bit          _BIT_ACCESS(CWG3CON0,6)
// CWG3AS0<CWG3LSAC0>
extern volatile __bit                   CWG3LSAC0           __at(0x1FA32);	// @ (0x3F46 * 8 + 2)
#define                                 CWG3LSAC0_bit       _BIT_ACCESS(CWG3AS0,2)
// CWG3AS0<CWG3LSAC1>
extern volatile __bit                   CWG3LSAC1           __at(0x1FA33);	// @ (0x3F46 * 8 + 3)
#define                                 CWG3LSAC1_bit       _BIT_ACCESS(CWG3AS0,3)
// CWG3AS0<CWG3LSBD0>
extern volatile __bit                   CWG3LSBD0           __at(0x1FA34);	// @ (0x3F46 * 8 + 4)
#define                                 CWG3LSBD0_bit       _BIT_ACCESS(CWG3AS0,4)
// CWG3AS0<CWG3LSBD1>
extern volatile __bit                   CWG3LSBD1           __at(0x1FA35);	// @ (0x3F46 * 8 + 5)
#define                                 CWG3LSBD1_bit       _BIT_ACCESS(CWG3AS0,5)
// CWG3AS0<CWG3LSDB0>
extern volatile __bit                   CWG3LSDB0           __at(0x1FA34);	// @ (0x3F46 * 8 + 4)
#define                                 CWG3LSDB0_bit       _BIT_ACCESS(CWG3AS0,4)
// CWG3AS0<CWG3LSDB1>
extern volatile __bit                   CWG3LSDB1           __at(0x1FA35);	// @ (0x3F46 * 8 + 5)
#define                                 CWG3LSDB1_bit       _BIT_ACCESS(CWG3AS0,5)
// PMD4<CWG3MD>
extern volatile __bit                   CWG3MD              __at(0x1CE27);	// @ (0x39C4 * 8 + 7)
#define                                 CWG3MD_bit          _BIT_ACCESS(PMD4,7)
// CWG3CON0<CWG3MODE0>
extern volatile __bit                   CWG3MODE0           __at(0x1FA20);	// @ (0x3F44 * 8 + 0)
#define                                 CWG3MODE0_bit       _BIT_ACCESS(CWG3CON0,0)
// CWG3CON0<CWG3MODE1>
extern volatile __bit                   CWG3MODE1           __at(0x1FA21);	// @ (0x3F44 * 8 + 1)
#define                                 CWG3MODE1_bit       _BIT_ACCESS(CWG3CON0,1)
// CWG3CON0<CWG3MODE2>
extern volatile __bit                   CWG3MODE2           __at(0x1FA22);	// @ (0x3F44 * 8 + 2)
#define                                 CWG3MODE2_bit       _BIT_ACCESS(CWG3CON0,2)
// CWG3STR<CWG3OVRA>
extern volatile __bit                   CWG3OVRA            __at(0x1FA44);	// @ (0x3F48 * 8 + 4)
#define                                 CWG3OVRA_bit        _BIT_ACCESS(CWG3STR,4)
// CWG3STR<CWG3OVRB>
extern volatile __bit                   CWG3OVRB            __at(0x1FA45);	// @ (0x3F48 * 8 + 5)
#define                                 CWG3OVRB_bit        _BIT_ACCESS(CWG3STR,5)
// CWG3STR<CWG3OVRC>
extern volatile __bit                   CWG3OVRC            __at(0x1FA46);	// @ (0x3F48 * 8 + 6)
#define                                 CWG3OVRC_bit        _BIT_ACCESS(CWG3STR,6)
// CWG3STR<CWG3OVRD>
extern volatile __bit                   CWG3OVRD            __at(0x1FA47);	// @ (0x3F48 * 8 + 7)
#define                                 CWG3OVRD_bit        _BIT_ACCESS(CWG3STR,7)
// CWG3CON1<CWG3POLA>
extern volatile __bit                   CWG3POLA            __at(0x1FA28);	// @ (0x3F45 * 8 + 0)
#define                                 CWG3POLA_bit        _BIT_ACCESS(CWG3CON1,0)
// CWG3CON1<CWG3POLB>
extern volatile __bit                   CWG3POLB            __at(0x1FA29);	// @ (0x3F45 * 8 + 1)
#define                                 CWG3POLB_bit        _BIT_ACCESS(CWG3CON1,1)
// CWG3CON1<CWG3POLC>
extern volatile __bit                   CWG3POLC            __at(0x1FA2A);	// @ (0x3F45 * 8 + 2)
#define                                 CWG3POLC_bit        _BIT_ACCESS(CWG3CON1,2)
// CWG3CON1<CWG3POLD>
extern volatile __bit                   CWG3POLD            __at(0x1FA2B);	// @ (0x3F45 * 8 + 3)
#define                                 CWG3POLD_bit        _BIT_ACCESS(CWG3CON1,3)
// CWG3STR<CWG3STRA>
extern volatile __bit                   CWG3STRA            __at(0x1FA40);	// @ (0x3F48 * 8 + 0)
#define                                 CWG3STRA_bit        _BIT_ACCESS(CWG3STR,0)
// CWG3STR<CWG3STRB>
extern volatile __bit                   CWG3STRB            __at(0x1FA41);	// @ (0x3F48 * 8 + 1)
#define                                 CWG3STRB_bit        _BIT_ACCESS(CWG3STR,1)
// CWG3STR<CWG3STRC>
extern volatile __bit                   CWG3STRC            __at(0x1FA42);	// @ (0x3F48 * 8 + 2)
#define                                 CWG3STRC_bit        _BIT_ACCESS(CWG3STR,2)
// CWG3STR<CWG3STRD>
extern volatile __bit                   CWG3STRD            __at(0x1FA43);	// @ (0x3F48 * 8 + 3)
#define                                 CWG3STRD_bit        _BIT_ACCESS(CWG3STR,3)
// DAC1CON0<DAC1EN>
extern volatile __bit                   DAC1EN              __at(0x1F4F7);	// @ (0x3E9E * 8 + 7)
#define                                 DAC1EN_bit          _BIT_ACCESS(DAC1CON0,7)
// DAC1CON0<DAC1NSS>
extern volatile __bit                   DAC1NSS             __at(0x1F4F0);	// @ (0x3E9E * 8 + 0)
#define                                 DAC1NSS_bit         _BIT_ACCESS(DAC1CON0,0)
// DAC1CON0<DAC1OE1>
extern volatile __bit                   DAC1OE1             __at(0x1F4F5);	// @ (0x3E9E * 8 + 5)
#define                                 DAC1OE1_bit         _BIT_ACCESS(DAC1CON0,5)
// DAC1CON0<DAC1OE2>
extern volatile __bit                   DAC1OE2             __at(0x1F4F4);	// @ (0x3E9E * 8 + 4)
#define                                 DAC1OE2_bit         _BIT_ACCESS(DAC1CON0,4)
// DAC1CON0<DAC1PSS0>
extern volatile __bit                   DAC1PSS0            __at(0x1F4F2);	// @ (0x3E9E * 8 + 2)
#define                                 DAC1PSS0_bit        _BIT_ACCESS(DAC1CON0,2)
// DAC1CON0<DAC1PSS1>
extern volatile __bit                   DAC1PSS1            __at(0x1F4F3);	// @ (0x3E9E * 8 + 3)
#define                                 DAC1PSS1_bit        _BIT_ACCESS(DAC1CON0,3)
// DAC1CON1<DAC1R0>
extern volatile __bit                   DAC1R0              __at(0x1F4E0);	// @ (0x3E9C * 8 + 0)
#define                                 DAC1R0_bit          _BIT_ACCESS(DAC1CON1,0)
// DAC1CON1<DAC1R1>
extern volatile __bit                   DAC1R1              __at(0x1F4E1);	// @ (0x3E9C * 8 + 1)
#define                                 DAC1R1_bit          _BIT_ACCESS(DAC1CON1,1)
// DAC1CON1<DAC1R2>
extern volatile __bit                   DAC1R2              __at(0x1F4E2);	// @ (0x3E9C * 8 + 2)
#define                                 DAC1R2_bit          _BIT_ACCESS(DAC1CON1,2)
// DAC1CON1<DAC1R3>
extern volatile __bit                   DAC1R3              __at(0x1F4E3);	// @ (0x3E9C * 8 + 3)
#define                                 DAC1R3_bit          _BIT_ACCESS(DAC1CON1,3)
// DAC1CON1<DAC1R4>
extern volatile __bit                   DAC1R4              __at(0x1F4E4);	// @ (0x3E9C * 8 + 4)
#define                                 DAC1R4_bit          _BIT_ACCESS(DAC1CON1,4)
// PMD2<DACMD>
extern volatile __bit                   DACMD               __at(0x1CE16);	// @ (0x39C2 * 8 + 6)
#define                                 DACMD_bit           _BIT_ACCESS(PMD2,6)
// NVMDAT<DAT0>
extern volatile __bit                   DAT0                __at(0x1CF18);	// @ (0x39E3 * 8 + 0)
#define                                 DAT0_bit            _BIT_ACCESS(NVMDAT,0)
// NVMDAT<DAT1>
extern volatile __bit                   DAT1                __at(0x1CF19);	// @ (0x39E3 * 8 + 1)
#define                                 DAT1_bit            _BIT_ACCESS(NVMDAT,1)
// NVMDAT<DAT2>
extern volatile __bit                   DAT2                __at(0x1CF1A);	// @ (0x39E3 * 8 + 2)
#define                                 DAT2_bit            _BIT_ACCESS(NVMDAT,2)
// NVMDAT<DAT3>
extern volatile __bit                   DAT3                __at(0x1CF1B);	// @ (0x39E3 * 8 + 3)
#define                                 DAT3_bit            _BIT_ACCESS(NVMDAT,3)
// NVMDAT<DAT4>
extern volatile __bit                   DAT4                __at(0x1CF1C);	// @ (0x39E3 * 8 + 4)
