GopalSaraf/Practicals/PSDL/include/proc/pic18f24k42.h
#define                                 DAT4_bit            _BIT_ACCESS(NVMDAT,4)
// NVMDAT<DAT5>
extern volatile __bit                   DAT5                __at(0x1CF1D);	// @ (0x39E3 * 8 + 5)
#define                                 DAT5_bit            _BIT_ACCESS(NVMDAT,5)
// NVMDAT<DAT6>
extern volatile __bit                   DAT6                __at(0x1CF1E);	// @ (0x39E3 * 8 + 6)
#define                                 DAT6_bit            _BIT_ACCESS(NVMDAT,6)
// NVMDAT<DAT7>
extern volatile __bit                   DAT7                __at(0x1CF1F);	// @ (0x39E3 * 8 + 7)
#define                                 DAT7_bit            _BIT_ACCESS(NVMDAT,7)
// CRCDATL<DATA0>
extern volatile __bit                   DATA0               __at(0x1CB00);	// @ (0x3960 * 8 + 0)
#define                                 DATA0_bit           _BIT_ACCESS(CRCDATL,0)
// CRCDATL<DATA1>
extern volatile __bit                   DATA1               __at(0x1CB01);	// @ (0x3960 * 8 + 1)
#define                                 DATA1_bit           _BIT_ACCESS(CRCDATL,1)
// CRCDATH<DATA10>
extern volatile __bit                   DATA10              __at(0x1CB0A);	// @ (0x3961 * 8 + 2)
#define                                 DATA10_bit          _BIT_ACCESS(CRCDATH,2)
// CRCDATH<DATA11>
extern volatile __bit                   DATA11              __at(0x1CB0B);	// @ (0x3961 * 8 + 3)
#define                                 DATA11_bit          _BIT_ACCESS(CRCDATH,3)
// CRCDATH<DATA12>
extern volatile __bit                   DATA12              __at(0x1CB0C);	// @ (0x3961 * 8 + 4)
#define                                 DATA12_bit          _BIT_ACCESS(CRCDATH,4)
// CRCDATH<DATA13>
extern volatile __bit                   DATA13              __at(0x1CB0D);	// @ (0x3961 * 8 + 5)
#define                                 DATA13_bit          _BIT_ACCESS(CRCDATH,5)
// CRCDATH<DATA14>
extern volatile __bit                   DATA14              __at(0x1CB0E);	// @ (0x3961 * 8 + 6)
#define                                 DATA14_bit          _BIT_ACCESS(CRCDATH,6)
// CRCDATH<DATA15>
extern volatile __bit                   DATA15              __at(0x1CB0F);	// @ (0x3961 * 8 + 7)
#define                                 DATA15_bit          _BIT_ACCESS(CRCDATH,7)
// CRCDATL<DATA2>
extern volatile __bit                   DATA2               __at(0x1CB02);	// @ (0x3960 * 8 + 2)
#define                                 DATA2_bit           _BIT_ACCESS(CRCDATL,2)
// CRCDATL<DATA3>
extern volatile __bit                   DATA3               __at(0x1CB03);	// @ (0x3960 * 8 + 3)
#define                                 DATA3_bit           _BIT_ACCESS(CRCDATL,3)
// CRCDATL<DATA4>
extern volatile __bit                   DATA4               __at(0x1CB04);	// @ (0x3960 * 8 + 4)
#define                                 DATA4_bit           _BIT_ACCESS(CRCDATL,4)
// CRCDATL<DATA5>
extern volatile __bit                   DATA5               __at(0x1CB05);	// @ (0x3960 * 8 + 5)
#define                                 DATA5_bit           _BIT_ACCESS(CRCDATL,5)
// CRCDATL<DATA6>
extern volatile __bit                   DATA6               __at(0x1CB06);	// @ (0x3960 * 8 + 6)
#define                                 DATA6_bit           _BIT_ACCESS(CRCDATL,6)
// CRCDATL<DATA7>
extern volatile __bit                   DATA7               __at(0x1CB07);	// @ (0x3960 * 8 + 7)
#define                                 DATA7_bit           _BIT_ACCESS(CRCDATL,7)
// CRCDATH<DATA8>
extern volatile __bit                   DATA8               __at(0x1CB08);	// @ (0x3961 * 8 + 0)
#define                                 DATA8_bit           _BIT_ACCESS(CRCDATH,0)
// CRCDATH<DATA9>
extern volatile __bit                   DATA9               __at(0x1CB09);	// @ (0x3961 * 8 + 1)
#define                                 DATA9_bit           _BIT_ACCESS(CRCDATH,1)
// CRCCON1<DLEN0>
extern volatile __bit                   DLEN0               __at(0x1CB4C);	// @ (0x3969 * 8 + 4)
#define                                 DLEN0_bit           _BIT_ACCESS(CRCCON1,4)
// CRCCON1<DLEN1>
extern volatile __bit                   DLEN1               __at(0x1CB4D);	// @ (0x3969 * 8 + 5)
#define                                 DLEN1_bit           _BIT_ACCESS(CRCCON1,5)
// CRCCON1<DLEN2>
extern volatile __bit                   DLEN2               __at(0x1CB4E);	// @ (0x3969 * 8 + 6)
#define                                 DLEN2_bit           _BIT_ACCESS(CRCCON1,6)
// CRCCON1<DLEN3>
extern volatile __bit                   DLEN3               __at(0x1CB4F);	// @ (0x3969 * 8 + 7)
#define                                 DLEN3_bit           _BIT_ACCESS(CRCCON1,7)
// PIE2<DMA1AIE>
extern volatile __bit                   DMA1AIE             __at(0x1CC93);	// @ (0x3992 * 8 + 3)
#define                                 DMA1AIE_bit         _BIT_ACCESS(PIE2,3)
// PIR2<DMA1AIF>
extern volatile __bit                   DMA1AIF             __at(0x1CD13);	// @ (0x39A2 * 8 + 3)
#define                                 DMA1AIF_bit         _BIT_ACCESS(PIR2,3)
// IPR2<DMA1AIP>
extern volatile __bit                   DMA1AIP             __at(0x1CC13);	// @ (0x3982 * 8 + 3)
#define                                 DMA1AIP_bit         _BIT_ACCESS(IPR2,3)
// DMA1AIRQ<DMA1AIRQ0>
extern volatile __bit                   DMA1AIRQ0           __at(0x1DFF0);	// @ (0x3BFE * 8 + 0)
#define                                 DMA1AIRQ0_bit       _BIT_ACCESS(DMA1AIRQ,0)
// DMA1AIRQ<DMA1AIRQ1>
extern volatile __bit                   DMA1AIRQ1           __at(0x1DFF1);	// @ (0x3BFE * 8 + 1)
#define                                 DMA1AIRQ1_bit       _BIT_ACCESS(DMA1AIRQ,1)
// DMA1AIRQ<DMA1AIRQ2>
extern volatile __bit                   DMA1AIRQ2           __at(0x1DFF2);	// @ (0x3BFE * 8 + 2)
#define                                 DMA1AIRQ2_bit       _BIT_ACCESS(DMA1AIRQ,2)
// DMA1AIRQ<DMA1AIRQ3>
extern volatile __bit                   DMA1AIRQ3           __at(0x1DFF3);	// @ (0x3BFE * 8 + 3)
#define                                 DMA1AIRQ3_bit       _BIT_ACCESS(DMA1AIRQ,3)
// DMA1AIRQ<DMA1AIRQ4>
extern volatile __bit                   DMA1AIRQ4           __at(0x1DFF4);	// @ (0x3BFE * 8 + 4)
#define                                 DMA1AIRQ4_bit       _BIT_ACCESS(DMA1AIRQ,4)
// DMA1AIRQ<DMA1AIRQ5>
extern volatile __bit                   DMA1AIRQ5           __at(0x1DFF5);	// @ (0x3BFE * 8 + 5)
#define                                 DMA1AIRQ5_bit       _BIT_ACCESS(DMA1AIRQ,5)
// DMA1AIRQ<DMA1AIRQ6>
extern volatile __bit                   DMA1AIRQ6           __at(0x1DFF6);	// @ (0x3BFE * 8 + 6)
#define                                 DMA1AIRQ6_bit       _BIT_ACCESS(DMA1AIRQ,6)
// DMA1CON0<DMA1AIRQEN>
extern volatile __bit                   DMA1AIRQEN          __at(0x1DFE2);	// @ (0x3BFC * 8 + 2)
#define                                 DMA1AIRQEN_bit      _BIT_ACCESS(DMA1CON0,2)
// DMA1BUF<DMA1BUF0>
extern volatile __bit                   DMA1BUF0            __at(0x1DF48);	// @ (0x3BE9 * 8 + 0)
#define                                 DMA1BUF0_bit        _BIT_ACCESS(DMA1BUF,0)
// DMA1BUF<DMA1BUF1>
extern volatile __bit                   DMA1BUF1            __at(0x1DF49);	// @ (0x3BE9 * 8 + 1)
#define                                 DMA1BUF1_bit        _BIT_ACCESS(DMA1BUF,1)
// DMA1BUF<DMA1BUF2>
extern volatile __bit                   DMA1BUF2            __at(0x1DF4A);	// @ (0x3BE9 * 8 + 2)
#define                                 DMA1BUF2_bit        _BIT_ACCESS(DMA1BUF,2)
// DMA1BUF<DMA1BUF3>
extern volatile __bit                   DMA1BUF3            __at(0x1DF4B);	// @ (0x3BE9 * 8 + 3)
#define                                 DMA1BUF3_bit        _BIT_ACCESS(DMA1BUF,3)
// DMA1BUF<DMA1BUF4>
extern volatile __bit                   DMA1BUF4            __at(0x1DF4C);	// @ (0x3BE9 * 8 + 4)
#define                                 DMA1BUF4_bit        _BIT_ACCESS(DMA1BUF,4)
// DMA1BUF<DMA1BUF5>
extern volatile __bit                   DMA1BUF5            __at(0x1DF4D);	// @ (0x3BE9 * 8 + 5)
#define                                 DMA1BUF5_bit        _BIT_ACCESS(DMA1BUF,5)
// DMA1BUF<DMA1BUF6>
extern volatile __bit                   DMA1BUF6            __at(0x1DF4E);	// @ (0x3BE9 * 8 + 6)
#define                                 DMA1BUF6_bit        _BIT_ACCESS(DMA1BUF,6)
// DMA1BUF<DMA1BUF7>
extern volatile __bit                   DMA1BUF7            __at(0x1DF4F);	// @ (0x3BE9 * 8 + 7)
#define                                 DMA1BUF7_bit        _BIT_ACCESS(DMA1BUF,7)
// DMA1DCNTL<DMA1DCNT0>
extern volatile __bit                   DMA1DCNT0           __at(0x1DF50);	// @ (0x3BEA * 8 + 0)
#define                                 DMA1DCNT0_bit       _BIT_ACCESS(DMA1DCNTL,0)
// DMA1DCNTL<DMA1DCNT1>
extern volatile __bit                   DMA1DCNT1           __at(0x1DF51);	// @ (0x3BEA * 8 + 1)
#define                                 DMA1DCNT1_bit       _BIT_ACCESS(DMA1DCNTL,1)
// DMA1DCNTH<DMA1DCNT10>
extern volatile __bit                   DMA1DCNT10          __at(0x1DF5A);	// @ (0x3BEB * 8 + 2)
#define                                 DMA1DCNT10_bit      _BIT_ACCESS(DMA1DCNTH,2)
// DMA1DCNTH<DMA1DCNT11>
extern volatile __bit                   DMA1DCNT11          __at(0x1DF5B);	// @ (0x3BEB * 8 + 3)
#define                                 DMA1DCNT11_bit      _BIT_ACCESS(DMA1DCNTH,3)
// DMA1DCNTL<DMA1DCNT2>
extern volatile __bit                   DMA1DCNT2           __at(0x1DF52);	// @ (0x3BEA * 8 + 2)
#define                                 DMA1DCNT2_bit       _BIT_ACCESS(DMA1DCNTL,2)
// DMA1DCNTL<DMA1DCNT3>
extern volatile __bit                   DMA1DCNT3           __at(0x1DF53);	// @ (0x3BEA * 8 + 3)
#define                                 DMA1DCNT3_bit       _BIT_ACCESS(DMA1DCNTL,3)
// DMA1DCNTL<DMA1DCNT4>
extern volatile __bit                   DMA1DCNT4           __at(0x1DF54);	// @ (0x3BEA * 8 + 4)
#define                                 DMA1DCNT4_bit       _BIT_ACCESS(DMA1DCNTL,4)
// DMA1DCNTL<DMA1DCNT5>
extern volatile __bit                   DMA1DCNT5           __at(0x1DF55);	// @ (0x3BEA * 8 + 5)
#define                                 DMA1DCNT5_bit       _BIT_ACCESS(DMA1DCNTL,5)
// DMA1DCNTL<DMA1DCNT6>
extern volatile __bit                   DMA1DCNT6           __at(0x1DF56);	// @ (0x3BEA * 8 + 6)
#define                                 DMA1DCNT6_bit       _BIT_ACCESS(DMA1DCNTL,6)
// DMA1DCNTL<DMA1DCNT7>
extern volatile __bit                   DMA1DCNT7           __at(0x1DF57);	// @ (0x3BEA * 8 + 7)
#define                                 DMA1DCNT7_bit       _BIT_ACCESS(DMA1DCNTL,7)
// DMA1DCNTH<DMA1DCNT8>
extern volatile __bit                   DMA1DCNT8           __at(0x1DF58);	// @ (0x3BEB * 8 + 0)
#define                                 DMA1DCNT8_bit       _BIT_ACCESS(DMA1DCNTH,0)
// DMA1DCNTH<DMA1DCNT9>
extern volatile __bit                   DMA1DCNT9           __at(0x1DF59);	// @ (0x3BEB * 8 + 1)
#define                                 DMA1DCNT9_bit       _BIT_ACCESS(DMA1DCNTH,1)
// PIE2<DMA1DCNTIE>
extern volatile __bit                   DMA1DCNTIE          __at(0x1CC91);	// @ (0x3992 * 8 + 1)
#define                                 DMA1DCNTIE_bit      _BIT_ACCESS(PIE2,1)
// PIR2<DMA1DCNTIF>
extern volatile __bit                   DMA1DCNTIF          __at(0x1CD11);	// @ (0x39A2 * 8 + 1)
#define                                 DMA1DCNTIF_bit      _BIT_ACCESS(PIR2,1)
// IPR2<DMA1DCNTIP>
extern volatile __bit                   DMA1DCNTIP          __at(0x1CC11);	// @ (0x3982 * 8 + 1)
#define                                 DMA1DCNTIP_bit      _BIT_ACCESS(IPR2,1)
// DMA1CON0<DMA1DGO>
extern volatile __bit                   DMA1DGO             __at(0x1DFE5);	// @ (0x3BFC * 8 + 5)
#define                                 DMA1DGO_bit         _BIT_ACCESS(DMA1CON0,5)
// DMA1DPTRL<DMA1DPTR0>
extern volatile __bit                   DMA1DPTR0           __at(0x1DF60);	// @ (0x3BEC * 8 + 0)
#define                                 DMA1DPTR0_bit       _BIT_ACCESS(DMA1DPTRL,0)
// DMA1DPTRL<DMA1DPTR1>
extern volatile __bit                   DMA1DPTR1           __at(0x1DF61);	// @ (0x3BEC * 8 + 1)
#define                                 DMA1DPTR1_bit       _BIT_ACCESS(DMA1DPTRL,1)
// DMA1DPTRH<DMA1DPTR10>
extern volatile __bit                   DMA1DPTR10          __at(0x1DF6A);	// @ (0x3BED * 8 + 2)
#define                                 DMA1DPTR10_bit      _BIT_ACCESS(DMA1DPTRH,2)
// DMA1DPTRH<DMA1DPTR11>
extern volatile __bit                   DMA1DPTR11          __at(0x1DF6B);	// @ (0x3BED * 8 + 3)
#define                                 DMA1DPTR11_bit      _BIT_ACCESS(DMA1DPTRH,3)
// DMA1DPTRH<DMA1DPTR12>
extern volatile __bit                   DMA1DPTR12          __at(0x1DF6C);	// @ (0x3BED * 8 + 4)
#define                                 DMA1DPTR12_bit      _BIT_ACCESS(DMA1DPTRH,4)
// DMA1DPTRH<DMA1DPTR13>
extern volatile __bit                   DMA1DPTR13          __at(0x1DF6D);	// @ (0x3BED * 8 + 5)
#define                                 DMA1DPTR13_bit      _BIT_ACCESS(DMA1DPTRH,5)
// DMA1DPTRH<DMA1DPTR14>
extern volatile __bit                   DMA1DPTR14          __at(0x1DF6E);	// @ (0x3BED * 8 + 6)
#define                                 DMA1DPTR14_bit      _BIT_ACCESS(DMA1DPTRH,6)
// DMA1DPTRH<DMA1DPTR15>
extern volatile __bit                   DMA1DPTR15          __at(0x1DF6F);	// @ (0x3BED * 8 + 7)
#define                                 DMA1DPTR15_bit      _BIT_ACCESS(DMA1DPTRH,7)
// DMA1DPTRL<DMA1DPTR2>
extern volatile __bit                   DMA1DPTR2           __at(0x1DF62);	// @ (0x3BEC * 8 + 2)
#define                                 DMA1DPTR2_bit       _BIT_ACCESS(DMA1DPTRL,2)
// DMA1DPTRL<DMA1DPTR3>
extern volatile __bit                   DMA1DPTR3           __at(0x1DF63);	// @ (0x3BEC * 8 + 3)
#define                                 DMA1DPTR3_bit       _BIT_ACCESS(DMA1DPTRL,3)
// DMA1DPTRL<DMA1DPTR4>
extern volatile __bit                   DMA1DPTR4           __at(0x1DF64);	// @ (0x3BEC * 8 + 4)
#define                                 DMA1DPTR4_bit       _BIT_ACCESS(DMA1DPTRL,4)
// DMA1DPTRL<DMA1DPTR5>
extern volatile __bit                   DMA1DPTR5           __at(0x1DF65);	// @ (0x3BEC * 8 + 5)
#define                                 DMA1DPTR5_bit       _BIT_ACCESS(DMA1DPTRL,5)
// DMA1DPTRL<DMA1DPTR6>
extern volatile __bit                   DMA1DPTR6           __at(0x1DF66);	// @ (0x3BEC * 8 + 6)
#define                                 DMA1DPTR6_bit       _BIT_ACCESS(DMA1DPTRL,6)
// DMA1DPTRL<DMA1DPTR7>
extern volatile __bit                   DMA1DPTR7           __at(0x1DF67);	// @ (0x3BEC * 8 + 7)
#define                                 DMA1DPTR7_bit       _BIT_ACCESS(DMA1DPTRL,7)
// DMA1DPTRH<DMA1DPTR8>
extern volatile __bit                   DMA1DPTR8           __at(0x1DF68);	// @ (0x3BED * 8 + 0)
#define                                 DMA1DPTR8_bit       _BIT_ACCESS(DMA1DPTRH,0)
// DMA1DPTRH<DMA1DPTR9>
extern volatile __bit                   DMA1DPTR9           __at(0x1DF69);	// @ (0x3BED * 8 + 1)
#define                                 DMA1DPTR9_bit       _BIT_ACCESS(DMA1DPTRH,1)
// DMA1DSAL<DMA1DSA0>
extern volatile __bit                   DMA1DSA0            __at(0x1DF80);	// @ (0x3BF0 * 8 + 0)
#define                                 DMA1DSA0_bit        _BIT_ACCESS(DMA1DSAL,0)
// DMA1DSAL<DMA1DSA1>
extern volatile __bit                   DMA1DSA1            __at(0x1DF81);	// @ (0x3BF0 * 8 + 1)
#define                                 DMA1DSA1_bit        _BIT_ACCESS(DMA1DSAL,1)
// DMA1DSAH<DMA1DSA10>
extern volatile __bit                   DMA1DSA10           __at(0x1DF8A);	// @ (0x3BF1 * 8 + 2)
#define                                 DMA1DSA10_bit       _BIT_ACCESS(DMA1DSAH,2)
// DMA1DSAH<DMA1DSA11>
extern volatile __bit                   DMA1DSA11           __at(0x1DF8B);	// @ (0x3BF1 * 8 + 3)
#define                                 DMA1DSA11_bit       _BIT_ACCESS(DMA1DSAH,3)
// DMA1DSAH<DMA1DSA12>
extern volatile __bit                   DMA1DSA12           __at(0x1DF8C);	// @ (0x3BF1 * 8 + 4)
#define                                 DMA1DSA12_bit       _BIT_ACCESS(DMA1DSAH,4)
// DMA1DSAH<DMA1DSA13>
extern volatile __bit                   DMA1DSA13           __at(0x1DF8D);	// @ (0x3BF1 * 8 + 5)
#define                                 DMA1DSA13_bit       _BIT_ACCESS(DMA1DSAH,5)
// DMA1DSAH<DMA1DSA14>
extern volatile __bit                   DMA1DSA14           __at(0x1DF8E);	// @ (0x3BF1 * 8 + 6)
#define                                 DMA1DSA14_bit       _BIT_ACCESS(DMA1DSAH,6)
// DMA1DSAH<DMA1DSA15>
extern volatile __bit                   DMA1DSA15           __at(0x1DF8F);	// @ (0x3BF1 * 8 + 7)
#define                                 DMA1DSA15_bit       _BIT_ACCESS(DMA1DSAH,7)
// DMA1DSAL<DMA1DSA2>
extern volatile __bit                   DMA1DSA2            __at(0x1DF82);	// @ (0x3BF0 * 8 + 2)
#define                                 DMA1DSA2_bit        _BIT_ACCESS(DMA1DSAL,2)
// DMA1DSAL<DMA1DSA3>
extern volatile __bit                   DMA1DSA3            __at(0x1DF83);	// @ (0x3BF0 * 8 + 3)
#define                                 DMA1DSA3_bit        _BIT_ACCESS(DMA1DSAL,3)
// DMA1DSAL<DMA1DSA4>
extern volatile __bit                   DMA1DSA4            __at(0x1DF84);	// @ (0x3BF0 * 8 + 4)
#define                                 DMA1DSA4_bit        _BIT_ACCESS(DMA1DSAL,4)
// DMA1DSAL<DMA1DSA5>
extern volatile __bit                   DMA1DSA5            __at(0x1DF85);	// @ (0x3BF0 * 8 + 5)
#define                                 DMA1DSA5_bit        _BIT_ACCESS(DMA1DSAL,5)
// DMA1DSAL<DMA1DSA6>
extern volatile __bit                   DMA1DSA6            __at(0x1DF86);	// @ (0x3BF0 * 8 + 6)
#define                                 DMA1DSA6_bit        _BIT_ACCESS(DMA1DSAL,6)
// DMA1DSAL<DMA1DSA7>
extern volatile __bit                   DMA1DSA7            __at(0x1DF87);	// @ (0x3BF0 * 8 + 7)
#define                                 DMA1DSA7_bit        _BIT_ACCESS(DMA1DSAL,7)
// DMA1DSAH<DMA1DSA8>
extern volatile __bit                   DMA1DSA8            __at(0x1DF88);	// @ (0x3BF1 * 8 + 0)
#define                                 DMA1DSA8_bit        _BIT_ACCESS(DMA1DSAH,0)
// DMA1DSAH<DMA1DSA9>
extern volatile __bit                   DMA1DSA9            __at(0x1DF89);	// @ (0x3BF1 * 8 + 1)
#define                                 DMA1DSA9_bit        _BIT_ACCESS(DMA1DSAH,1)
// DMA1DSZL<DMA1DSZ0>
extern volatile __bit                   DMA1DSZ0            __at(0x1DF70);	// @ (0x3BEE * 8 + 0)
#define                                 DMA1DSZ0_bit        _BIT_ACCESS(DMA1DSZL,0)
// DMA1DSZL<DMA1DSZ1>
extern volatile __bit                   DMA1DSZ1            __at(0x1DF71);	// @ (0x3BEE * 8 + 1)
#define                                 DMA1DSZ1_bit        _BIT_ACCESS(DMA1DSZL,1)
// DMA1DSZH<DMA1DSZ10>
extern volatile __bit                   DMA1DSZ10           __at(0x1DF7A);	// @ (0x3BEF * 8 + 2)
#define                                 DMA1DSZ10_bit       _BIT_ACCESS(DMA1DSZH,2)
// DMA1DSZH<DMA1DSZ11>
extern volatile __bit                   DMA1DSZ11           __at(0x1DF7B);	// @ (0x3BEF * 8 + 3)
#define                                 DMA1DSZ11_bit       _BIT_ACCESS(DMA1DSZH,3)
// DMA1DSZL<DMA1DSZ2>
extern volatile __bit                   DMA1DSZ2            __at(0x1DF72);	// @ (0x3BEE * 8 + 2)
#define                                 DMA1DSZ2_bit        _BIT_ACCESS(DMA1DSZL,2)
// DMA1DSZL<DMA1DSZ3>
extern volatile __bit                   DMA1DSZ3            __at(0x1DF73);	// @ (0x3BEE * 8 + 3)
#define                                 DMA1DSZ3_bit        _BIT_ACCESS(DMA1DSZL,3)
// DMA1DSZL<DMA1DSZ4>
extern volatile __bit                   DMA1DSZ4            __at(0x1DF74);	// @ (0x3BEE * 8 + 4)
#define                                 DMA1DSZ4_bit        _BIT_ACCESS(DMA1DSZL,4)
// DMA1DSZL<DMA1DSZ5>
extern volatile __bit                   DMA1DSZ5            __at(0x1DF75);	// @ (0x3BEE * 8 + 5)
#define                                 DMA1DSZ5_bit        _BIT_ACCESS(DMA1DSZL,5)
// DMA1DSZL<DMA1DSZ6>
extern volatile __bit                   DMA1DSZ6            __at(0x1DF76);	// @ (0x3BEE * 8 + 6)
#define                                 DMA1DSZ6_bit        _BIT_ACCESS(DMA1DSZL,6)
// DMA1DSZL<DMA1DSZ7>
extern volatile __bit                   DMA1DSZ7            __at(0x1DF77);	// @ (0x3BEE * 8 + 7)
#define                                 DMA1DSZ7_bit        _BIT_ACCESS(DMA1DSZL,7)
// DMA1DSZH<DMA1DSZ8>
extern volatile __bit                   DMA1DSZ8            __at(0x1DF78);	// @ (0x3BEF * 8 + 0)
#define                                 DMA1DSZ8_bit        _BIT_ACCESS(DMA1DSZH,0)
// DMA1DSZH<DMA1DSZ9>
extern volatile __bit                   DMA1DSZ9            __at(0x1DF79);	// @ (0x3BEF * 8 + 1)
#define                                 DMA1DSZ9_bit        _BIT_ACCESS(DMA1DSZH,1)
// DMA1CON0<DMA1EN>
extern volatile __bit                   DMA1EN              __at(0x1DFE7);	// @ (0x3BFC * 8 + 7)
#define                                 DMA1EN_bit          _BIT_ACCESS(DMA1CON0,7)
// PMD7<DMA1MD>
extern volatile __bit                   DMA1MD              __at(0x1CE38);	// @ (0x39C7 * 8 + 0)
#define                                 DMA1MD_bit          _BIT_ACCESS(PMD7,0)
// PIE2<DMA1ORIE>
extern volatile __bit                   DMA1ORIE            __at(0x1CC92);	// @ (0x3992 * 8 + 2)
#define                                 DMA1ORIE_bit        _BIT_ACCESS(PIE2,2)
// PIR2<DMA1ORIF>
extern volatile __bit                   DMA1ORIF            __at(0x1CD12);	// @ (0x39A2 * 8 + 2)
#define                                 DMA1ORIF_bit        _BIT_ACCESS(PIR2,2)
// IPR2<DMA1ORIP>
extern volatile __bit                   DMA1ORIP            __at(0x1CC12);	// @ (0x3982 * 8 + 2)
#define                                 DMA1ORIP_bit        _BIT_ACCESS(IPR2,2)
// DMA1PR<DMA1PR0>
extern volatile __bit                   DMA1PR0             __at(0x1CF98);	// @ (0x39F3 * 8 + 0)
#define                                 DMA1PR0_bit         _BIT_ACCESS(DMA1PR,0)
// DMA1PR<DMA1PR1>
extern volatile __bit                   DMA1PR1             __at(0x1CF99);	// @ (0x39F3 * 8 + 1)
#define                                 DMA1PR1_bit         _BIT_ACCESS(DMA1PR,1)
// DMA1PR<DMA1PR2>
extern volatile __bit                   DMA1PR2             __at(0x1CF9A);	// @ (0x39F3 * 8 + 2)
#define                                 DMA1PR2_bit         _BIT_ACCESS(DMA1PR,2)
// DMA1SCNTL<DMA1SCNT0>
extern volatile __bit                   DMA1SCNT0           __at(0x1DF90);	// @ (0x3BF2 * 8 + 0)
#define                                 DMA1SCNT0_bit       _BIT_ACCESS(DMA1SCNTL,0)
// DMA1SCNTL<DMA1SCNT1>
extern volatile __bit                   DMA1SCNT1           __at(0x1DF91);	// @ (0x3BF2 * 8 + 1)
#define                                 DMA1SCNT1_bit       _BIT_ACCESS(DMA1SCNTL,1)
// DMA1SCNTH<DMA1SCNT10>
extern volatile __bit                   DMA1SCNT10          __at(0x1DF9A);	// @ (0x3BF3 * 8 + 2)
#define                                 DMA1SCNT10_bit      _BIT_ACCESS(DMA1SCNTH,2)
// DMA1SCNTH<DMA1SCNT11>
extern volatile __bit                   DMA1SCNT11          __at(0x1DF9B);	// @ (0x3BF3 * 8 + 3)
#define                                 DMA1SCNT11_bit      _BIT_ACCESS(DMA1SCNTH,3)
// DMA1SCNTL<DMA1SCNT2>
extern volatile __bit                   DMA1SCNT2           __at(0x1DF92);	// @ (0x3BF2 * 8 + 2)
#define                                 DMA1SCNT2_bit       _BIT_ACCESS(DMA1SCNTL,2)
// DMA1SCNTL<DMA1SCNT3>
extern volatile __bit                   DMA1SCNT3           __at(0x1DF93);	// @ (0x3BF2 * 8 + 3)
#define                                 DMA1SCNT3_bit       _BIT_ACCESS(DMA1SCNTL,3)
// DMA1SCNTL<DMA1SCNT4>
extern volatile __bit                   DMA1SCNT4           __at(0x1DF94);	// @ (0x3BF2 * 8 + 4)
#define                                 DMA1SCNT4_bit       _BIT_ACCESS(DMA1SCNTL,4)
// DMA1SCNTL<DMA1SCNT5>
extern volatile __bit                   DMA1SCNT5           __at(0x1DF95);	// @ (0x3BF2 * 8 + 5)
#define                                 DMA1SCNT5_bit       _BIT_ACCESS(DMA1SCNTL,5)
// DMA1SCNTL<DMA1SCNT6>
